古诗名=${.poetry_标题};
单字古诗名=${.poetry_单字标题};
古诗_诗句=${.poetry_诗句}+;
古诗_作者=${.poetry_作者};

古诗=(诗|古诗|唐诗);
宋词=(词|宋词);
诗词=(${.poetry_对象});
gs_说=(说|讲|读|朗读|朗诵|念|来);
gs_背诵=(背|背诵);
gs_播放=(帮我|给我|替我)?(播|播放|放);
gs_收听1=(我|我们)?(想|想要|要)?(听|听一?听);
gs_收听2=(让我|给我)?(听|听一?听);
gs_收听=${gs_收听1}|${gs_收听2};
gs_操作=(${gs_说}|${gs_背诵}|${gs_播放}|${gs_收听});

export poetry1=(你?给我|你?为我|我想听你|我要听你|你?给我们|你?为我们)?(${gs_说}|${gs_背诵})(一?个|一?段|一?首|点|两首|两个|几首|一些|几个)?(${诗词})(${语气词})?$ => request(poetryflag1="古诗",domain="古诗") <0.9>;
export poetry12=你?(会|能|能不能|会不会|能否|来)(为我们?|给我们?)?(${gs_说}|${gs_背诵})(一?个|一?段|一?首|点|两首|两个|几首|一些|几个)?(${诗词})(${语气词})?$ => request(poetryflag1="古诗",domain="古诗") <0.9>;
export poetry4=^(古诗|唐诗)(${语气词})?$ => request(poetryflag1="古诗",domain="古诗") <0.9>;
export poetry1=(说|讲|背|背诵|朗诵)(个|一个|一段|段|首|一首)?(古诗|唐诗)(${古诗名}) => request(poetryflag1="古诗",domain="古诗") <0.9>;
export poetry45=(古诗|唐诗)(${古诗名}) => request(poetryflag1="古诗",domain="古诗") <0.6>;
export poetry45=^(古诗|唐诗)(${古诗名}) => request(poetryflag1="古诗",domain="古诗") <0.8>;
export poetry45=(古诗|唐诗)(${古诗名})$ => request(poetryflag1="古诗",domain="古诗") <0.8>;
export poetry43=(古诗|唐诗)(${单字古诗名})(${语气词})?$ => request(poetryflag1="古诗",domain="古诗") <0.9>;
export poetry44=^(${gs_操作})(一)?(会|个|段|首|下)?(${诗词})(${语气词})?$ => request(poetryflag1="古诗",domain="古诗") <0.9>;
export poetry45=^(我想看|我要看|${gs_操作})(一)?(个|段|首|下)?(${诗词})(${古诗名})(${语气词})?$ => request(poetryflag1="古诗",domain="古诗") <0.85>;
export peotry46=^(${gs_操作}|我想看|我要看)(一?个|一?段|一?首|点|两首|两个|几首|一些|几个)?(${诗词})(${语气词})?$ => request(poetryflag1="古诗", domain="古诗") <0.85>;
export poetry46=(我想听|我要听|播放|我想看|我要看|${gs_操作})(一)?(个|段|首|下)?(${古诗名})(${语气词})?$ => request(poetryflag1="古诗",domain="古诗") <0.796>;

export poetry5=^你?(会|能|能不能|会不会|能否)?(给我|为我)?(${gs_说}|${gs_背诵}|听|看|放|播|念)(一)?(个|段|首|下|部)?(${古诗名})$ => request(poetryflag1="古诗",domain="古诗") <0.56>;
export poetry5=(来|说|讲|听|看|放|播|念|背|背诵)(一)?(个|段|首|下|部)?(视频)?(${古诗名})$ => request(poetryflag1="古诗",domain="古诗") <0.2>;



##### update by zhangyu & peilu.w #####
##### 支持诗句, 作者, 定位等功能 #####
## 朗读说法的支持 ##
export poetry6_1=^(给我|为我|我想听你|我要听你|给我们|为我们)?(读|朗读|念)(一)?(个|段|首|下)?(${诗词})(${语气词})?$ => request(domain="古诗") <0.7>;
export poetry6_2=你?(会|能|能不能|会不会|能否)(为我|给我)?(读|朗读|念)(一)?(个|段|首|下)?(${诗词}) => request(domain="古诗") <0.54>;
export poetry6_3=(读|朗读|念)(一)?(个|段|首|下)?(诗|古诗|唐诗)(${古诗名}) => request(domain="古诗") <0.3>;
export poetry6_3=^(播放|放|播)(一)?(个|段|首|下)?(${古诗名})${语气词}?$ => request(domain="古诗") <0.68>;
export poetry6_4=(读|朗读|念|朗诵)(一)?(个|段|首|下)?(${古诗名}) => request(domain="古诗") <0.411>;
## 作者 & 标题 ##
export poetry7_1=(我|我们)?(想|要|想要)(看|听)(一)?(个|段|首|下)?(${古诗_作者})(的|写的)?(${诗词})(叫|名叫|叫作)?(${古诗名})? => request(domain="古诗") <0.5>;
export poetry7_2=(我|我们)?(想|要|想要)(看|听)(一)?(个|段|首|下)?(${古诗_作者})(的|写的)?(作品|大作|诗歌)?(叫|名叫|叫作)?(${古诗名}) => request(domain="古诗") <0.3>;
export poetry7_3=(来|说|讲|放|播|读|诵|念)(一)?(个|段|首|下)?(${古诗_作者})(的|写的)?(${诗词})(叫|名叫|叫作)?(${古诗名})? => request(domain="古诗") <0.56>;
export poetry7_4=(${gs_操作})(一)?(个|段|首|下)?(${古诗_作者})(的|写的)?(作品|大作|诗歌)?(叫|名叫|叫作)?(${古诗名}) => request(domain="古诗") <0.3>;
export poetry7_5=(${古诗_作者})(的)?(${诗词})(${古诗名})? => request(domain="古诗") <0.3>;
export poetry7_6=(${古诗_作者})(的)?(${古诗名}) => request(domain="古诗") <0.41>;
export poetry7_7=(${gs_操作})(一)?(个|段|首|下)?(${古诗_作者})(的|写的)?(${诗词})(${语气词})?$ => request(domain="古诗") <0.71>;
## 诗句 ##
export poetry8_1 = ^(我|我们)?(想|要|想要)?(看|听)?(一)?(个|段|首|下)?(${古诗_诗句})(${语气词})?$ => request(domain="古诗") <0.5>;
export poetry8_2 = (来|说|讲|放|播|读|诵|念)(一)?(个|段|首|下)(${古诗_诗句})(${语气词})?$ => request(domain="古诗") <0.53>;
export poetry8_2 = (来|说|讲|放|播|读|诵|念)(${古诗_诗句})(${语气词})?$ => request(domain="古诗") <0.2>;
export poetry8_3 = ^(${古诗_诗句})$ => request(domain="古诗") <0.3>;
#export poetry8_4 = (${古诗_诗句}) => request(domain="古诗") <0.1>;
## 上下句 ##
export poetry9_1 = (${古诗_诗句})(的?)(上一句|前一句|上句|前句|下一句|后一句|下句|后句) => request(domain="古诗") <0.5>;
export poetry9_3 = (${古诗名})(的?)(第一句|首句|第二句|次句|尾句|末句|倒数第一句|最后一句|次尾句|次末句|倒数第二句) => request(domain="古诗") <0.3>;

## 定义句子位置变量 ##
gs第N句=第(${整数})句;
gs倒数第N句=倒数第(${整数})句; 
export poetry10 = (${古诗名})(的?)(${gs第N句}) => request(domain="古诗") <0.3>;
export poetry10 = (${古诗名})(的?)(${gs倒数第N句}) => request(domain="古诗") <0.3>;
##### 给定搜索条件, 搜索特定的内容 #####
#查询对象
#给古诗名问作者
export poetry11_1 = (${古诗名})(的?)(作者)(是谁)? => request(domain="古诗") <0.2>;
export poetry11_1 = (${古诗名})(那首诗|这首诗)?(是?)(谁)(的?)(大作|写的|作品|所作|所写|所创作|创作|提出|发表|写出|诗|词|古诗) => request(domain="古诗") <0.2>;
#给句子问作者
export poetry11_2=(${古诗_诗句})(的?)(作者)(是谁)? => request(domain="古诗") <0.3>;
export poetry11_2=(${古诗_诗句})(是|来自|出自)?(谁)(的?)(大作|写的|作品|所作|所写|所创作|创作|提出|发表|写出|诗|词|古诗) =>request(domain="古诗") <0.3>;
#给句子问古诗名
export poetry11_3=(${古诗_诗句})(是|来自|出自)?(哪|那)(首|个)(诗|词|古诗|唐诗)(的?)(句子)? => request(domain="古诗") <0.3>;
export poetry11_3_1=^(${古诗_诗句})(是|来自|出自)(哪|那)(首|个)(诗|词|古诗|唐诗)(${语气词})?$ => request(domain="古诗") <0.65>;
export poetry11_4=(哪|什么)(一)?(首|段|个)?(诗|古诗|唐诗)(里|里面|中|中间|其中)(有|含|含有|包含)(那个|那句|那一句)?(${古诗_诗句}) => request(domain="古诗") <0.3>;

## by zhangyu ##
## 添加查询句式 ##
export poetry11_5=(哪一?个)(诗人|作者)(写|作|提)(的|了)?(唐诗|古诗|诗|诗句|名句)?(${古诗名}|${古诗_诗句}) => request(domain="古诗") <0.2>;

##### 一些特殊说法 #####
export poetry_sp1 = ^(给我|为我)(来)(一)?(首诗)$ => request(domain="古诗") <0.81>;
export poetry_sp2 = ^(给我|为我)来(一)?首(${古诗名})(${语气词})?$ => request(domain="古诗") <0.56>;
export poetry_sp3 = ^(来|说|讲|放|播|读|诵|念|听)古诗$ => request(domain="古诗") <0.56>;

######bug by xuyang
export poetry7_2_bug=^(我|我们)?(想|要|想要)(看|听)(一)?(个|段|首|下)?(${古诗_作者})(的)?(作品|大作|诗歌)?(叫|名叫|叫作)?(${古诗名})$ => request(domain="古诗") <0.466>;
export poetry7_3_bug=(播放|放|播|来|说|讲|背|背诵|读|朗读)(一)?(个|段|首|下)?(${古诗_作者})(的)?(作品|大作|诗歌)?(叫|名叫|叫作)?(${古诗名})$ => request(domain="古诗") <0.466>;

##### by zhangyu #####
## 单字标题 ##
export poetry_single1 = (想|要|想要)(看|听)(一)?(个|段|首|下)?(${古诗_作者})?(的)?(唐诗|古诗)(${单字古诗名}) => request(domain="古诗") <0.4>;
export poetry_single2 = ^(给我|为我)?(来|说|讲|背|背诵|读|朗读)(一)?(个|段|首|下)?(${古诗_作者})?(的)?(唐诗|古诗)(${单字古诗名}) => request(domain="古诗") <0.4>;

###by jiangkun
export poetry_single11 = ^(播放|播|讲|来|听|背|背诵|朗诵|读|我想听|我要听|帮我放|给我放|替我放)(个|一个|首|一首)?(${古诗名})$ => request(domain="古诗") <0.4>;
export poetry_single11 = ^(播放|播|讲|来|听|背|背诵|朗诵|读|我想听|我要听|帮我放|给我放|替我放)(个|一个|首|一首)?(宋词|词)(${古诗名})$ => request(domain="古诗") <0.755>;

# by jy for 故事机
export 0919_1 = ^(我想看|我要看|${gs_操作})(一)?(个|段|首|下|会儿?)?(${古诗名}|${单字古诗名})(${古诗_作者})(${语气词})?$ => request(domain="古诗") <0.66>;
export 0919_1_1 = ^(我想看|我要看|${gs_操作})(一)?(个|段|首|下|会儿?)?(${单字古诗名})(${古诗_作者})(${语气词})?$ => request(domain="古诗") <0.5>;
export 0919_2 = ^(${古诗名}|${单字古诗名})(${古诗_作者})$ => request(domain="古诗") <0.4>;
export 0919_2 = ^(${诗词})$ => request(domain="古诗") <0.8>;

#export poetry45=^(我想看|我要看|${gs_操作})(一)?(个|段|首|下)?(${古诗名})(${语气词})?$ => request(poetryflag1="古诗",domain="古诗") <0.75>;


# for 酷旗_线上分析 20180102 JY
export poetry01021 = ^(${句首修饰词})?(${gs_操作})(一)?(个|段|首|下)?(${诗词}) => request(domain="古诗") <0.3>;

# kuqi 线上数据 lyf
export poetry0115 = (${古诗名})怎么(读|背|背诵|讲)(${语气词})?$ => request(domain="古诗") <0.3>;
export poetry0115_1 = ^(${句首修饰词})?(${gs_操作})(一)?(个|段|首|下)?(${古诗名})的(古诗|诗|诗词)(${语气词})?$ => request(domain="古诗") <0.5>;

export poetry_single11 = ^(${古诗名})$ => request(domain="古诗") <0.2>;
