
## by zhangyu, 2019-03-12
## 数值属性 正则词库提供
## 表达 亮度、对比度、音量 等的 数值、大小、百分数 的相关定义
## 变量前缀使用 _zk (中控zhongkong)

## 通用动词定义
_dig=一|二|三|四|五|六|七|八|九
_dig_10=${_dig}十
_dig_10_2=${_dig}十${_dig}
_num整数=${_dig_10}|${_dig_10_2}|${_dig}
_zk调高1=(开大|加强|调高|调大|升高|增大|增加|提高|变大|大|高|加|开大|加大|高档|开大|增强|强|上升|升|增|放大|提升|升高|变高|增|提|加上)(一点|一点点|一些|点|些|一些些|一小点)? => ("+");
_zk调低1=(开小|减轻|调低|调小|调小了|降低|减小|变小|小|低|减少|减|关小|下降|低档|关小|减弱|弱|降|变少|变低|少|减低)(一点|一点点|一些|点|些|一些些|一小点)? => ("-");
_zk调高2=(大|高)(一点|一点点|一些|点|些)? => ("+");
_zk调低2=(小|低|少)(一点|一点点|一些|点|些)? => ("-");

_zk调高=${_zk调高1}|${_zk调高2};
_zk调低=${_zk调低1}|${_zk调低2};
_zk数值调整=${_zk调高}|${_zk调低};
_zk数值调到=(${_zk调高1}|${_zk调低1}|调|设|设置|调整|开|整|搞|调节|变|弄|改|更换)(到|至|成|为);

## 最高、最低
_zk最高=最高|最大|最亮|最响|最强|最热|最暖|最暖和|最湿|最快 => ("max");
_zk最低=最低|最小|最暗|最弱|最冷|最凉|最干|最慢 => ("min");

## 整数、百分数定义
_zk整数数值=(${_num整数}) => ("$1");
_zk百分数数值=(百分之)(${_num整数}) => (_join,prefix="$2",mid="%");


###### 输出变量定义
## 数值直接输出, eg. "音量五"、"音量百分之四十" 这样的句子
_zk数值直接输出 = (${_zk整数数值}|${_zk百分数数值});

## 调高/调低数值 进行输出
_zk调整数值输出 = (${_zk数值调整})(${_zk数值直接输出}) => (_join,prefix="$1",mid="$2");

## 调整到数值 进行输出
_zk调整到数值输出 = (${_zk数值调到})(${_zk数值直接输出}) => ("$2");

## 调高、调低、最高、最低 进行输出
_zk最值相对输出 = (${_zk数值调整}|${_zk数值调到}|调|调整|设置|设|变|改|更换)?(${_zk最高}|${_zk最低}) => ("$2");


## 相对输出

# 亮度词汇单独处理
_zk亮=(亮|太暗)(一点|一点点|一些|点|些)? => ('+');
_zk暗=(暗|太亮|太刺眼|柔和)(一点|一点点|一些|点|些)? => ('-');
_zk相对亮度=${_zk亮}|${_zk暗};

# 音量词汇单独处理
_zk大声=(声音)?(再)?(响|大声|大点儿?声音?|听不见|听不清)(一点|一点点|一些|点|些)? => ('+');
_zk大声222=大一?点(声音?|音量) => ('+');
_zk小声=(声音)?(再)?(小声|小点儿?声音?|太吵|声音轻点|声音轻些|声音轻一点|声音轻一些|轻一点|太响|轻点声|请安静|安静一点|安静点)(一点|一点点|一些|点|些)? => ('-');
_zk小声222=(小一?点|轻一?点)(声音?|音量) => ('-');
_zk相对音量=${_zk大声}|${_zk小声}|${_zk大声222}|${_zk小声222};

# 相对数值，对外进行输出。即直接归一成 "+" "-" 的
_zk通用相对输出 = (${_zk数值调整}|${_zk数值调到}|调|调整|设置|设|变|改|更换)?(${_zk相对亮度}|${_zk相对音量}|${_zk数值调整}) => ("$2");

########## 最终对外输出变量
export _zk数值属性 = (${_zk数值直接输出}|${_zk调整数值输出}|${_zk调整到数值输出}|${_zk通用相对输出}|${_zk最值相对输出});
