##### update by zhangyu #####
##### 给古诗领域添加slot操作="背诵"|"说"|"收听" #####

export poetry4=(poe古诗_类别)(${古诗名}) => request(古诗名="$2") <0.9>;
export poetry4=(${古诗名})<2,-1> => request(古诗名="$1") <0.2>;

## 操作 & 古诗名 ##
export poetry4_1 = (${poe操作})(一)?(个|段|首|下)?(poe古诗_类别)?(${古诗名}) => request(古诗名="$5", 操作="$1") <0.3>;

##### update by zhangyu & peilu.wang #####
##### 支持新说法 & 新的搜索条件 #####
## 作者名 ##
export poetry6_5=(${古诗_作者})(的)?(${poe古诗_类别}) => request(对象="$3", 作者="$1") <0.2>;
export poetry6_6=(${古诗_作者})(的)?(作品|大作|诗歌) => request(作者="$1") <0.1>;
## 作者名&古诗名 ##
export poetry7_5=(${古诗_作者})(的)?(${poe古诗_类别}|作品|大作|诗歌)(${古诗名}) => request(作者="$1", 古诗名="$4") <0.3>;
export poetry7_7=(${古诗_作者})(的)?(${古诗名}) => request(作者="$1", 古诗名="$3") <0.1>;
## 单句诗句 ##
export poetry8=(${古诗_诗句}) => request(诗句="$1") <0.1>;
##
export poetry_and1=(${_合成诗句1}) => request(诗句="$1") <0.2>;
export poetry_and2=(${_合成国学句子1}) => request(诗句="$1") <0.2>;
##
##### by zhangyu #####
## 单字古诗名 ##
export poetry_sp1 = (想|要|想要)(看|听)(一)?(个|段|首|下)?(${古诗_作者})?(的)?(唐诗|古诗)(${单字古诗名}) => request(作者="$6", 古诗名="$8") <0.3>;
export poetry_sp2 = ^(给我|为我)?(来|说|讲|背|背诵|读|朗读|念)(一)?(个|段|首|下)?(${古诗_作者})?(的)?(唐诗|古诗)(${单字古诗名}) => request(作者="$5", 古诗名="$8") <0.3>;

##add by jiangkun
export poetry1_1=(${poe操作})(个|一个|一段|段|首|一首|一些|一?下)?(${古诗_作者})?(的|写的)?(${poe古诗_类别})?(${古诗名}) => request(古诗名="$6", 操作="$1", 对象="$5", 作者="$3") <0.6>;
export poetry7_4=(${poe操作})(一)?(个|段|首|下|点|两首|两个|几首|些|几个|会)?(${古诗_作者})?(的)?(${poe古诗_类别}) => request(作者="$4", 对象="$6", 操作="$1") <0.6>;

#add by jy 20170919
export poetry9_1=(${古诗名})(${古诗_作者}) => request(作者="$2", 古诗名="$1") <0.2>;

#古诗名和诗句重复的bug
export poetry1_2=(${poe操作})(个|一个|一段|段|首|一首|一些|一?下)?(${古诗_作者})?(的|写的)?(${poe古诗_类别})?(${古诗名})(${语气词})?$ => request(古诗名="$6",诗句="",操作="$1", 对象="$5", 作者="$3") <0.61>;

# for 酷旗_线上分析 20180102 JY
export poetry01021=(${poe操作})(一)?(个|段|首|下)?(${古诗_诗句}) => request(操作="$1") <0.2>;

# kuqi 线上数据 lyf
export poetry0115 = (${古诗名})怎么(${poe背诵}|${poe说})(${语气词})?$ => request(古诗名="$1",操作="$2") <0.3>;

