##### by zhangyu & peilu.wang #####
##### 给定搜索条件, 搜索特定的内容 #####
#查询对象
#给古诗名问作者
export gushi4=(${古诗名})(的?)(作者) => request(查询对象="作者",古诗名="$1") <0.5>;
export gushi4=(${古诗名})(是?)(谁)(的?)(大作|写的|作品|所作|所写|所创作|创作|提出|发表|写出|诗|词|古诗) => request(查询对象="作者",古诗名="$1") <0.5>;
#给句子问作者
export gushi4=(${古诗_诗句})(的?)(作者)=> request(查询对象="作者",诗句="$1") <0.5>;
export gushi4=(${古诗_诗句})(是|来自|出自)?(谁)(的?)(大作|写的|作品|所作|所写|所创作|创作|提出|发表|写出|诗|词|古诗) => request(查询对象="作者",诗句="$1") <0.5>;

#给句子问古诗名
export gushi4=(${古诗_诗句})(是|来自|出自)?(哪|那)(首|个)(诗|词|古诗|唐诗)(里的|里面的|的)?(句子)? => request(查询对象="古诗名",诗句="$1") <0.5>;
export gushi5 = (哪|什么)(一)?(首|段|个)?(诗|古诗|唐诗)(里|里面|中|中间|其中)(有|含|含有|包含)(那个|那句|那一句)?(${古诗_诗句}) => request(查询对象="古诗名", 诗句="$8") <0.5>;

## by zhangyu ##
## 添加查询句式 ##
export gushi5 = (哪一?个)(诗人|作者)(写|作|提)(的|了)?(唐诗|古诗|诗)?(${古诗名}) => request(查询对象="作者", 古诗名="$6") <0.2>;
export gushi6 = (哪一?个)(诗人|作者)(写|作|提)(的|了)?(诗句|名句)?(${古诗_诗句}) => request(查询对象="作者", 诗句="$6") <0.2>;

##kuqi 线上资源 lyf
export gushi7=(${古诗名})(那首诗|这首诗)(是?)(谁)(的?)(大作|写的|作品|所作|所写|所创作|创作|提出|发表|写出|诗|词|古诗) => request(查询对象="作者",古诗名="$1",对象="") <0.5>;