export language1=(${语种}) => request(语种="$1") <0.2>;
export language2=(${歌手名})的?(${语种}) => request(语种="$2") <0.1>;
export language3=(${语种})的?(${音乐类型}) => request(语种="$1") <0.2>;
export language4=(${语种})的?(${音乐类型})(${播放})?给?(我|我们|${宝宝})(听|要听|想听)? => request(语种="$1",歌曲名="") <0.35>;

####add by xuyang bug
来首2_language_bug=(听|来|放|播放|找|唱|点|播)(一|几|两|${整数})?(个|点|首|曲|支|些);
export language1_bug=^(给我|为我|替我|我想|我要|我想要|我需要|我可以|我能够?)?(${来首2_language_bug}|${播放}|听)?(${语种})的?(${对象})(${语气词})?$ => request(歌曲名="@") <0.31>;

## by zhangyu, 2019-08-12
export language1_bug2 = (${播放})(比较|较为|稍微|稍稍|较)?(出名|有名气?)的?(${语种})(${音乐类型}|${音乐})(${语气词})?$ => request(语种="$4", 歌曲名="@") <0.1>;
export language1_bug3 = (${播放})(比较|较为|稍微|稍稍|较)?(出名|有名气?)?的?(${语种})(传统)的?(${音乐类型}|${音乐})(${语气词})?$ => request(语种="$4", 歌曲名="@") <0.21>;


