export music_geci1= (${操作1})(一?下)?(${当前歌曲})的(歌词|版本) => request(操作="$1", 歌曲名="$3", 对象="$4") <0.6>;
export music_geci2= (${当前歌曲})的(歌词|版本)(${句首修饰词})?(${操作1})(一?下)? => request(操作="$4", 歌曲名="$1", 对象="$2") <0.6>;
export music_geci3= (${操作1})(一?下)?(歌词|版本) => request(操作="$1", 对象="$3") <0.6>;
export music_geci4= (歌词|版本)(${句首修饰词})?(${操作1})(一?下)? => request(操作="$3", 对象="$1") <0.6>;

music_w_切换 = (切换|切|换)(成|到)? => ("切换");
export music_geci5= (${播放}|${music_w_切换})一?(下|个|首|曲|支|点|些)?(${当前歌曲})?的?(别的|其它的|其他的|另外的|另外|其它|其他)(歌词|版本)  => request(操作="切换",歌曲名="$3", 对象="$5") <0.6>;
export music_geci6= (${播放}|${music_w_切换})一?(下|个|首|曲|支|点|些)?(${当前歌曲})?的?(${music_版本})的?(${mu_版})  => request(操作="$1",歌曲名="$3", 版本="$4", 对象="版本") <0.6>;

export music_geci7= (${播放}|${music_w_切换})一?(下|个|首|曲|支|点|些)?(${当前歌曲})?的?(${语种})的?(${mu_版})  => request(操作="$1",歌曲名="$3", 语种="$4", 对象="版本") <0.6>;
export music_geci8= (${播放}|${music_w_切换})一?(下|个|首|曲|支|点|些)?(${当前歌曲})?的?(${语种})的  => request(操作="$1",歌曲名="$3", 语种="$4") <0.6>;
