export yinliang1=(声音|音量|背景音|环绕声|功放音)(调|设置|开|关|调整到|设置为|调到|设置成)(${相对音量}|${音量加减}) => request(音量="$3",crfflag="0") <0.5>;
export yinliang2=(声音|音量|背景音|环绕声|功放音)(太大了|太小了|好小|好大)?(调|设置|开|关|调整|设置)(成|为|到)(${音量}) => request(音量="$5",crfflag="0") <0.5>;
export yinliang3=^把?(声音|音量|背景音|环绕声|功放音)再?(${相对音量}|${音量加减})$ => request(音量="$2",crfflag="0") <0.5>;
export yinliang4=^(${相对音量}|${音量加减})(高频|音乐|音箱)?(声音|音量)$ => request(音量="$1",crfflag="0") <0.5>;
export yinliang5=^(音箱|音乐)?(声音|音量|背景音|功放音)(太大了|太小了|好小|好大)?(调|设置|开|关|调整到|设置为|调到|设置成)?(${相对音量}|${音量加减}|${音量})$ => request(音量="$5",crfflag="0") <0.5>;
export yinliang6=^(声音|音量)(太大了|太小了|好小|好大)?(开|关)(${音量加减})$ => request(音量="$4",crfflag="0") <0.5001>;
export yinliang6=^(音乐)(${相对音量})$ => request(音量="$2",crfflag="0") <0.5001>;

export yinliang5=(音量|音响|声音)(${音量加减}|调|设|设置|加|减|调整|开)(到|至|成|为)(${音量}) => request(音量="$4",crfflag="0") <0.7>;
export yinliang5=(${音量加减}|调|设|设置|加|减|调整|开)(音量|音响|声音)(到|至|成|为)(${音量}) => request(音量="$4",crfflag="0") <0.7>;
export yinliang5=(${音量加减}|调|设|设置|加|减|调整|开)(到|至|成|为)(音量|音响|声音)(${音量}) => request(音量="$4",crfflag="0") <0.7>;
export yinliang5=(${音量加减}|调|设|设置|加|减|调整|开)(到|至|成|为)(${音量})(音量|音响|声音) => request(音量="$3",crfflag="0") <0.7>;
export yinliang5=(${音量加减}|调|设|设置|加|减|调整|开)(到|至|成|为)(${音量})的?(音量|音响|声音)$ => request(音量="$3",crfflag="0") <0.65>;
export yinliang5=^(${音量})的?(音量|音响|声音|声)$ => request(音量="$1",crfflag="0") <0.35>;

export yinliang1=(声音|音量|背景音|环绕声|功放音)(调|设置|开|关|调整到|设置为|调到|设置成)?再?(${相对音量}|${音量加减}) => request(音量="$3",crfflag="0") <0.4>;
export yinliang1=(${相对音量}|${音量加减})(高频)?(声音|音量) => request(音量="$1",crfflag="0") <0.2>;
export yinliang1=(${相对音量})<3,-1> => request(音量="$1") <0.2>;
export yinliang1=(${相对音量})$ => request(音量="$1") <0.2>;
export yinliang1=(音乐|音箱|音响)(声音|音量)?再?(${相对音量})$ => request(音量="$3",crfflag="0") <0.2>;
export yinliang1=(${音量加减})(音乐|音箱|音响)的?(声音|音量) => request(音量="$1",crfflag="0") <0.2>;

export yinliang1=(声音|音量|背景音|功放音)(太大了|太小了|好小|好大)?(调|设置|开|关|调整到|设置为|调到|设置成)?再?(${相对音量}|${音量加减}|${音量}) => request(音量="$4",crfflag="0") <0.2>;
export yinliang1=(声音|音量)(太大了|太小了|好小|好大)?再?(开|关)(${音量加减}) => request(音量="$4",crfflag="0") <0.3001>;




