#include "${pwd}/../../misc/num.lex"
歌曲名other=.+;
歌曲名=${.music_歌曲名}|挺好|看我的|${.music_英文歌曲};
歌手名=${.music_歌手名}|林侑嘉|${.music_英文歌手};
单字歌名=${.music_单字歌名};
女歌手=女声|女生|女歌手 =>("女生");
男歌手=男生|男声|男歌手 =>("男生");
歌手性别=${女歌手}|${男歌手}|${.music_歌手性别};
#歌手性别=${.music_歌手性别};
######场景
场景_睡觉=睡了|睡觉 =>("睡觉");
#场景_睡觉=睡了|睡觉|睡前|催眠|午休|睡眠|休息 =>("睡眠");
场景_健身=运动|健身 =>("健身");
场景_阅读=看书|阅读|学习|读书 =>("阅读");
场景_工作=工作|干活|上班=>("工作");

场景=游戏|健身|读书|看书|工作|瑜伽|运动|阅读|学习|干活|午休|睡眠|休息|广场舞|跳舞|催眠|${场景_睡觉}|酒吧|夜店|咖啡馆|沙发|喝咖啡|聚会|约会|做家务|做饭|打扫卫生|跑步|运动|健身|锻炼|KTV|上班;
#场景=游戏|${场景_健身}|${场景_阅读}|胎教|${场景_工作}|瑜伽|广场舞|跳舞|${场景_睡觉};
######音乐类型
音乐类型1=(串烧|乡村|原声带|原声带摇滚|另类|合唱|嘻哈|婚礼|弹唱|朋克|清唱|爵士|经典|翻唱|蓝调|说唱|中国风|古典|草原|现代|流行|电音|亲子)(歌曲|歌|音乐|乐|曲)? => ("$1");
音乐类型2=(HIPHOP|MTV|RANDB|RAP|RB|R&B|RPA|SOLO|R AND B流行|陕西民歌|音乐剧|诗歌|老歌|舞曲|美声|红歌|秦腔|苏格兰小调|男双对唱|男女合唱|男女对唱|男男合唱|男男对唱|祝酒歌|求爱歌|斗牛士舞曲|校园民谣|摇篮曲|摇篮歌|快歌|慢歌|情歌|客家山歌|山歌|山西民歌|大合唱|奏鸣曲|女女合唱|女女对唱|东北民歌|K歌经典|K歌经曲|K歌金曲|交响乐|三重奏|伴奏|圣经|水声|混音|热恋慢歌|独奏|布鲁斯|舞台|黄梅戏|昆曲|豫剧|越剧|粤剧|戏曲|京剧|电子|恐怖灵异|民谣|二次元|JAZZ|POP|经典老歌) => ("$1");
HIGH歌=嗨|HIGH|喊麦|DJ =>("DJ");
神曲=神曲|奇葩|魔性 =>("神曲");
佛教歌曲=佛教音乐|佛歌|佛教歌曲|佛教|佛乐 =>("佛教");
儿童歌曲=儿歌|儿童|儿童歌|儿童歌曲|儿童音乐|童谣|儿童童谣|儿童歌谣|小朋友|小孩|小孩子 =>("儿歌");
军旅歌曲=军旅|军旅歌曲|军歌  =>("军旅");
民族歌曲=民族|民族歌曲|民族风  =>("民族");
爱情歌曲=爱情歌曲|爱情民谣|爱情老歌 =>("爱情");
网络歌曲=网络神曲|网络神曲|网络音乐 =>("网络歌曲");
胎教歌曲=胎教|胎教歌|胎教音乐|胎教歌曲 =>("胎教");
轻声歌曲=轻声歌曲|轻声音乐|轻音乐 =>("轻音乐");
金属歌曲=重金属|重金属音乐|重金属歌曲|重音乐|金属|金属乐|金属歌曲|金属音乐 =>("金属乐");
摇滚歌曲=摇滚歌曲|摇滚音乐|摇滚|摇滚曲|摇滚乐 =>("摇滚");
摇篮歌曲=摇篮曲|摇篮歌|摇篮歌曲 =>("摇篮曲");
慢摇歌曲=慢摇|慢摇曲|慢摇歌曲|慢音乐 =>("慢摇");
藏族歌曲=藏族歌曲|藏族音乐|藏乐|藏歌  =>("藏族");
影视歌曲=影视歌曲|影视金曲 =>("影视歌曲");
幼儿歌曲=幼儿音乐|幼儿歌曲|宝宝歌谣 =>("幼儿歌曲");
催眠歌曲=催眠歌曲|宝宝催眠曲|安眠曲|睡眠曲|催眠曲|催眠曲儿 =>("催眠曲");
纯音乐=没歌词的歌|纯音乐|没歌词的 =>("纯音乐");
收藏music=收藏的?(音乐|歌曲|歌|曲子|歌曲)  => ("收藏列表");
音乐类型3=${佛教歌曲}|${儿童歌曲}|${军旅歌曲}|${民族歌曲}|${爱情歌曲}|${网络歌曲}|${胎教歌曲}|${轻声歌曲}|${金属歌曲}|${摇滚歌曲}|${摇篮歌曲}|${慢摇歌曲}|${藏族歌曲}|${影视歌曲}|${幼儿歌曲}|${催眠歌曲}|${纯音乐}|${HIGH歌}|${神曲}|文艺;
zy快 = (快|快速) => ("快歌");
zy慢 = (慢|慢速) => ("慢歌");
音乐类型_快慢歌 = (${zy快}|${zy慢})(节奏)(的)?(歌|歌曲|音乐|曲子) => ("$1");
音乐类型=${音乐类型1}|${音乐类型2}|${音乐类型3}|${音乐类型_快慢歌}|胎教DJ|DJ儿歌|${.music_音乐类型};
##########语种
英文=(英语|英文|外文|外语|国外|英国|外国) =>("英文");
日文=(日语|日本|日文) =>("日文");
泰文=(泰语|泰文|泰国) =>("泰文");
法文=(法语|法文|法国) =>("法文");
粤语=(白话|粤语|粵语) =>("粤语");
华语=(中文|华语|中国|国语) =>("华语");
韩文=韩国|韩文|韩语 =>("韩文");
闽南语=闽南|闽南语 =>("闽南语");
语种=${英文}|${日文}|${泰文}|${法文}|${粤语}|${华语}|${韩文}|丹麦语|俄语|克罗地亚语|匈牙利|台湾|台语|土耳其语|巴西葡萄牙语|希腊语|德语|意大利语|挪威语|捷克语|斯洛伐克语|斯洛文尼亚语|日韩|欧美|波兰语|济南话|瑞典语|美国|芬兰语|荷兰语|藏族|西班牙语|越南|重庆|${闽南语}|阿拉伯语|香港|${.music_语种};
##############
#音乐类型=${.music_音乐类型}|布鲁斯|舞台;
#语种=${.music_语种};
主题=${.music_主题};
主题类型=${.music_主题类型};
乐器=${.music_乐器};
专辑名=${.music_专辑名};
清新风格=小清新|清新=>("小清新");
伤心=伤心|失恋=>("伤心");
风格=${.music_风格}|世界|亲热|生日|网络|影视|动漫|校园|温暖|郁闷|治愈|疲惫|青春|休闲|小清新|清新|伤心|失恋;
#排行榜=${.music_排行榜};
######排行榜
排行_最新=最新|最近|新出的|最近新出的|最近出来的|最新的排行榜|刚出来|刚发行|刚刚出来|刚刚发行 =>("最新");
排行_最热=(最近|最近比较|比较|最)?(最热|最热门|最近流行|热门|最火|最近比较火|最近比较热门|最近比较热|排行榜最热|排行榜最火|最热的排行榜|最火的排行榜|大家听得多|比较热|比较火|比较流行|听的最多|大家听的最多|最流行) =>("最热");
排行榜=${排行_最新}|${排行_最热}|${.music_排行榜};

#######年代
年代5=(五十年代|五零年代|五几年|五几年代) => ("五十年代");
年代6=(六十年代|六零年代|六几年|六几年代) => ("六十年代");
年代7=(七十年代|七零年代|七几年|七几年代) => ("七十年代");
年代8=(八十年代|八零年代|八几年|八几年代) => ("八十年代");
年代9=(九十年代|九零年代|九几年|九几年代) => ("九十年代");
年代0=(零零年代|零几年|零几年代) => ("零零年代");
年代10=(一零年代|幺零年代|一几年|一几年代|幺几年|幺几年代) => ("一零年代");
年代=零零后|七零后|八零后|九零后|${年代5}|${年代6}|${年代7}|${年代8}|${年代9}|${年代10}|${年代0};

遍数=(${整数})(遍|次) => ("$1");
应用名=${.music_应用名};
音乐=歌曲|歌|音乐|MUSIC|曲子|虾米音乐|曲儿 => ("音乐");
歌单=歌单|歌曲列表=> ("歌单");
对象=${音乐}|专辑|单曲|歌单|歌曲列表;

###########操作

来首1=(听|来|放|播放|找|唱|点|播)(一|几)?(首|曲|支|些);
来首2=(听|来|放|播放|找|唱|点|播)(一|几|${整数})?(首|曲|支|些);
上一首1=(播放|重新播放|换成|换|切到|切|播|放|再)?(上|前)(一曲|一首|一个) => ("上一首");
上一首2=上首|再上首|上个歌|上首歌|刚才那首|前边那首 => ("上一首");
上一首=${上一首1}|${上一首2};
下一首=(播放|重新播放|换成|换|切到|切|播|放|再)?(下|后)(一曲|一首|一个|一种) => ("下一首");
下一首1=(换成|换|切到|切)(一曲|一首|一个) => ("下一首");
下一首2=(切歌|换歌|换首歌|下首|再下首|再来首|再来一首|下一个|下个|再下一个|下个歌|换一个|换首|跳过|放别的|别放这首了|换别的|别再重复了|不要放这首歌了) => ("下一首");
下一首3=(不要|别)再?(循环|重复)(播放|放|播)? => ("下一首");

上一列表=(播放|重新播放|换成|换|切到|切|播|放)?(上一频道|上一列表|上一个列表|上一个频道|上一个播放列表|上一播放列表) => ("上一列表");
下一列表=(播放|重新播放|换成|换|切到|切|播|放)?(下一频道|下一列表|下一个列表|下一个频道|下一个播放列表|下一播放列表) => ("下一列表");
下一列表1=(换成|换)(一)?(频道|列表|播放列表) => ("下一列表");

打开=(打开|开|开启|启动|进入|运行) => ("打开");
播放1=(放|播放|播|来|点)(一|几|两|${整数})?(点|首|曲|支|些) => ("播放");
播放=(给我|替我|帮我)?(${播放1}|插播|播|播报|播放|放|演唱|点播|唱|开始播放|点) => ("播放");
停止=停|停止|停止播放|停下来|停吧|停播|停下 => ("停止");
暂停=暂停|暂停播放|别放了|别吵了|不要放歌了|别播了|不要唱了|暂时停一下 => ("暂停");
单曲循环=一直放这首|就放这首|只放这首|只听这个|单曲循环|只放这个|只听这首|只播这个|只播这首 => ("单曲循环");
重复播放=重复播放|再放一次|重复|多听一遍|再来一遍|再听一次|再听一遍|再放一遍|重复放|重复播|重复这首|再唱一次 =>("重复播放");
循环播放=循环播放|循环放|循环播 => ("循环播放");

关闭=(关闭|关|关了|关掉|结束|你关闭吧) => ("关闭");
退出1=退出播放|退出|退下|退了|你退下吧|你退出吧 => ("退出");
退出2=我?(不听了|不想听了|不听歌了|不要听了|不听音乐了) => ("退出");
退出=${退出1}|${退出2};
返回=回到|返回 => ("返回");
显示=显示|查看 => ("显示");
继续=(继续|接着|接着上次|解除暂停)(放|播放)? => ("继续");
休眠=(休眠|睡眠|你去睡吧|你休息吧|睡觉去吧|那你睡觉吧|你去休息吧|休息一下|休息吧|你该休息了|你休眠吧|赶紧休眠|休息一会儿) =>("休眠");
显示歌词=显示歌词|歌词显示 =>("显示歌词");
操作_new=(切换|切|调节|调) => ("打开");
单曲循环1=(一直播放|只听|只放|只播|循环播放)(这首|这支|这一首|这一个|这一|这个) => ("单曲循环");
单曲循环new=单曲循环|${单曲循环1};
随机播放=随机播放|乱序播放 => ("随机播放");
随机播放模式=随机播放模式  => ("随机播放模式");
顺序播放1=(不要|别)再?(重复|循环)(放|播|播放)?了?;
顺序播放=顺序播放模式|顺序播放|${顺序播放1} => ("顺序播放");
操作1=${返回}|${显示}|下载|取消|${播放}|${停止}|${暂停}|${退出}|${打开}|${关闭}|${继续}|推荐|${休眠};
操作=${操作1}|${上一首}|${下一首}|${下一首1}|${下一首2}|${下一首3}|${上一列表}|${下一列表}|${下一列表1}|${顺序播放}|${循环播放}|${随机播放}|随机循环|顺序循环|${单曲循环}|列表循环|暂停下载|${重复播放}|收藏|${显示歌词};
操作up=(再|给我|帮我|替我)?(顺序播放|顺序播放|循环播放|${随机播放}|${随机播放模式}|随机循环|顺序循环|${单曲循环new}|列表循环|暂停下载|重复播放|全部循环) => ("$2");

USB=USB|U盘|优盘 =>("USB");
网络=网络|网上  => ("网络");
音源=${USB}|CD|IPOD|本地|${网络}|SD卡|蓝牙;
#############

语气词=(呢|吗|呀|啊|吧|哟|好吗|可以吗|谢谢|呜|哇|咯|噢|么|呜|唉|唔|呗|呵呵|哈哈|嗯|呃|嘛|哦|呐|哎|啦|了|诶|好了)+;

序列号1=(第)(${整数})(个|首|曲|首歌曲) => ("$2");
序列号2=最后一个|最后那个|最后这个|倒数第一首|最后一首|最后那首|最后这首|倒数第一首 =>("#1");
序列号3=(倒数|最后)(第|后|那)?(${整数})(个|首|曲) => (_join,prefix="#",mid="$3");
序列号4=(中间)(一|那|这|那一|这一)(个|首|曲) => ("mid");
序列号5=(选)(第)?(${整数}) => ("$3");
序列号=${序列号1}|${序列号2}|${序列号3}|${序列号4}|${序列号5};

上一页=上一页|前一页|往上翻|往上翻页|往前翻|往前翻页 => ("-1");
下一页=下一页|后一页|往下翻|往下翻页|往后翻|往后翻页|翻页|翻一页 => ("+1");
上N页=(上|前|前面|上翻|前翻|往前翻|往上翻)(${整数})页 => (_join,prefix="-",mid="$2");
下N页=(下|后|后面|下翻|后翻|往后翻|往下翻)(${整数})页 => (_join,prefix="+",mid="$2");
页码3=(倒数|最后)(第|后|那)?(${整数})(页) => (_join,prefix="#",mid="$3");
页码4=(中间)(一|那|这|那一|这一)(页) => ("mid");
页码2=第(${整数})页 => ("$1");
页码1=${页码3}|${页码2}|${页码4};

_再见=再见|拜拜|闭嘴|BYE|我?不想说了?|不说了|明天见|下次见|滚吧|滚犊子|滚蛋|给我滚|滚球|GOODBYE|滚一边去|明天见|滚蛋吧|滚开|快滚|晚安|你给我滚蛋|你可以滚了|谢谢再见|你滚蛋|我要睡觉了晚安|你退出吧|你给我闭嘴|滚你妈的|再见亲爱的|睡觉了晚安|我叫你滚|退出来|滚远一点|滚出去|快点滚|不用了再见 => ("退出");


#include "${pwd}/actsentence.lex"

export b1=^你好小乐|小乐你好|小乐继续|小乐来首歌|小乐我要听歌|我要听那个叫叫那个呃|我要听那个叫叫什么|小乐我想听|小乐我想听歌$ => request(crfflag="0") <0.8>;

#export opt17=(${操作})(一)?(点|首|曲)?(音乐|歌曲|歌|专辑|MUSIC) => request(操作="$1") <0.22>;

if not actflag then
#include "${pwd}/varlex/歌手性别.lex"
#include "${pwd}/varlex/歌手名.lex"
#include "${pwd}/varlex/语种.lex"
#include "${pwd}/varlex/排行榜.lex"
#include "${pwd}/varlex/乐器.lex"
#include "${pwd}/varlex/主题类型.lex"
#include "${pwd}/varlex/音乐类型.lex"
#include "${pwd}/varlex/专辑名.lex"
#include "${pwd}/varlex/主题.lex"
#include "${pwd}/varlex/操作.lex"
#include "${pwd}/varlex/歌曲名.lex"
#include "${pwd}/varlex/风格.lex"
#include "${pwd}/varlex/序列号.lex"
##include "${pwd}/varlex/场景.lex"
##include "${pwd}/varlex/心情.lex"
#include "${pwd}/varlex/action.lex"
#include "${pwd}/varlex/年代.lex"
#include "${pwd}/varlex/重复次数.lex"
#include "${pwd}/varlex/节奏.lex"
#include "${pwd}/varlex/歌曲数量.lex"
#include "${pwd}/varlex/音乐场景.lex"
#include "${pwd}/varlex/声音类型.lex"
end


#include "${pwd}/播放列表.lex"

export yinyuan1=(${音源})(上|里)?的?(音乐|歌曲)? => request(音源="$1") <0.2>;
export opt2=(${对象}) => request(对象="$1") <0.201>;
export opt0=(${操作}|听|来)(一|几|${整数})?(些|首|点)?(${对象}) => request(对象="$4",播放列表="") <0.4>;


歌曲随便=(随便|随机|随意) => ("dontcare");
export singer =^(给我|替我)?(${歌曲随便})(给我|替我)?(来|听|放|播|播放|听听)一?(首|点|曲)?(歌|音乐) => request(歌曲名="$2") <0.81>;
export singer =^(给我|替我)?(${歌曲随便})(给我|替我)?(来|听|放|播|播放|听听)一?(首|点|曲)?(${歌手名}|${风格})的(歌|音乐) => request(歌曲名="$2") <0.81>;
export singer =^(给我|替我)?(${歌曲随便})(给我|替我)?(听|放|播|播放|听听|来)(一)?(首|曲|个)$ => request(歌曲名="$2") <0.81>;
export singer =(${歌手名})的(歌|音乐|歌曲)(给我|替我)?(${歌曲随便})(给我|替我)?(来|听|放|播|播放|听听)一?(首|点|曲|个) => request(歌曲名="$5") <0.81>;
export singer =(${歌曲随便})(给我|替我)?(来|听|放|播|播放|听听)(首|点|曲)?(歌|音乐) => request(歌曲名="$1") <0.3>;
export singer =(${歌曲随便})(给我|替我)?(听|放|播|播放|听听) => request(歌曲名="$1") <0.13>;
export singer =(${歌曲随便})(给我|替我)?(听|放|播|播放|听听|来)(一)?(首|曲|个) => request(歌曲名="$1") <0.13>;
export singer =^(${歌曲随便})(${语气词})?$ => request(歌曲名="$1") <0.13>;
export music序列号=(播放|放|来)(第)(${整数})(首|支)(歌|歌曲|曲) $=> request(序列号="$3")<0.65>;

ss给我 = (给|替|为)(我|我们|爷);
ss推荐首 = (推荐)(几|${整数})(首|支|曲);
export singer2 = ^(${ss给我})?(${歌曲随便})(${ss给我})?(${来首2}|${ss推荐首})(${歌手名}|${排行榜}|${年代}|${乐器}|${语种}) => request(歌曲名="$2") <0.1>;



if not 对象 and not 歌曲名 and not 专辑名 and not 风格 and not 音乐类型  and not 音源  and not 播放列表 and not 性别 and not 乐器 and not 排行榜 and not 语种 and not 主题 and not 主题类型 and not 音量 and not 序列号 and not 页码 and not 年代 and not 重复次数 and not 节奏 and not __tgt__ and not actflag  and not 音乐场景 then
    export default1 = (我想听|我要听|播放)(首|一首|一下)?(${歌手名})的(.{2,10})(${语气词})?$ => request(歌曲名="$4") <0.06>;
    export default2 = (来|放)(首|一首|一下)(${歌手名})的(.{2,10})(${语气词})?$ => request(歌曲名="$4") <0.06>;
end

if not 对象 and not 歌曲名 and not 歌手名 and not 专辑名 and not 风格 and not 音乐类型  and not 音源  and not 播放列表 and not 性别  and not 乐器  and not 排行榜  and not 语种 and not 主题 and not 主题类型 and not 音量 and not 序列号 and not 页码 and not 年代 and not 重复次数 and not 节奏 and not __tgt__  and not actflag and not 音乐场景 then
    export default3 = (我想听|我要听|播放)(首|一首|一下)?(.{2,10})(${语气词})?$ => request(歌曲名="$3") <0.06>;
end



#if not 歌曲名 and not 歌手名 and not 风格 and not 音乐类型  and not 操作 and not 音源  and not 播放列表 and not actflag then
#    #include "${pwd}/housekeeping.lex"
#end

if not __act__ then 
    export affirm100 = ^啊|阿|世道|似的|吃的$ => request(__act__="affirm") <0.1>;
    export inform100 = .+ => request(__act__="inform") <0.1>;
end

