export opt1=(${上一首}|${下一首}|${下一首1}|${下一首5}) => request(操作="$1") <0.5>;
export opt11=^(${操作})$ => request(操作="$1") <0.7>;
export opt2=[^一](${操作})(${歌手名})的?(${歌曲名}) => request(操作="$1") <0.4>;
export opt3=^(${操作})(${歌手名})的?(${歌曲名}) => request(操作="$1") <0.4>;
export opt4=[^一](${操作})(${歌曲名}) => request(操作="$1") <0.3>;
export opt5=(${操作})(${歌曲名}) => request(操作="$1") <0.3>;
#export opt6=[^一](${操作})(${歌手名}|${语种}|${歌手性别}|${风格}|${对象}|${乐器}|${排行榜}) => request(操作="$1") <0.3>;
export opt63=[^一](给我|替我|帮我)?(${操作})(${歌手名}|${歌曲名}) => request(操作="$2") <0.25>;
export opt6311=^[^一](给我|替我|帮我)?(${操作})(${歌手名}|${语种}|${歌手性别}|${风格}|${对象}|${乐器}|${排行榜}) => request(操作="$2") <0.31>;
export opt61=^(${操作})(${歌手名}|${语种}|${歌手性别}|${风格}|${对象}|${乐器}|${排行榜}) => request(操作="$1") <0.3>;
export opt62=听(一|几|${整数}|两)?(些|点|曲|首)(${歌手名}|${语种}|${歌手性别}|${风格}|${对象}|${乐器}|${排行榜}|${场景}|${年代}|${音乐类型}) => request(操作="收听") <0.4111>;
export opt7=^(${操作})(${歌手名}|${语种}|${歌手性别}|${风格}|${对象}|${乐器}|${排行榜}) => request(操作="$1") <0.31>;
#export opt8=(${操作})(播放)?(歌曲|首歌|一些|一下|首|些|几首|一首) => request(操作="$1") <0.3>;
export opt91=[^一](${操作})(${音乐类型}|${对象}|${乐器}|${排行榜}) => request(操作="$1") <0.2>;
export opt911=收藏歌曲=> request(音乐类型="") <0.2>;
export opt92=^(${操作}|${music_查找}|${播放1})(${音乐类型}|${对象}|${乐器}|${排行榜}) => request(操作="$1") <0.2>;
export opt10=^(${操作})(${音乐类型}|${对象}|${乐器}|${排行榜}) => request(操作="$1") <0.2>;
export opt10=^(${操作})(这张|这个|一张)?(专辑|CD) => request(操作="$1") <0.2>;
export opt11=[^一](${操作})(${主题})的 => request(操作="$1") <0.2>;
export opt11=^(${操作})(${主题})的 => request(操作="$1") <0.2>;
export opt12=^(${操作})(${主题}|${歌手性别})的 => request(操作="$1") <0.2>;
export opt13=[^一](${操作})(${风格}) => request(操作="$1") <0.2>;
export opt14=^(${操作})(${风格}) => request(操作="$1") <0.2>;
export opt15=(${句首修饰词})(${操作}) => request(操作="$2") <0.2>;
export opt151=^(${句首修饰词})?(${操作}|${播放}|${播放2}|${music_查找1}) => request(操作="$2") <0.2>;
export opt16=[^一](${操作})(${语种}|${歌手性别}) => request(操作="$1") <0.2>;
export opt17=^(${操作})(这首|这个|这曲|那首|那个|那曲)?(音乐|歌曲|歌|单曲) => request(操作="$1") <0.2>;
#export opt17=(放|播放|来)(一)?(个|点|首|曲|支)?(音乐|歌曲|歌|单曲) => request(操作="播放") <0.2>;
#export opt17=(放|播放|来)(一)?(个|点|首|曲|支) => request(操作="播放") <0.2>;
export opt171=(${操作})(一)?(个|点|首|曲|这首)?(音乐|歌曲|歌|听歌|单曲) => request(操作="$1") <0.2>;
export opt172=(${播放2})(${歌手名})的(音乐|歌曲|歌|歌儿|听歌|单曲)(${歌曲名}) => request(操作="$1",歌手名="$2",歌曲名="$4",__act__="inform",__tgt__="@") <0.8>;



export bye1=(${_再见})(应用) => request(操作="$1") <0.8>;
export bye2=(${_再见})(${_再见}) => request(操作="$1") <0.8>;
export bye3=^(${语气词})?(${_再见})(${语气词})?$ => request(操作="$2") <0.8>;
export bye4=(${_再见})(${_再见})?(${语气词})?$ => request(操作="$2",聊天类型="") <0.81>;
export bye5=^(${语气词})?(白白|滚)(${语气词})?$ => request(操作="退出") <0.8>;
export bye3=(${_再见}) => request(操作="$1") <0.1>;

export opt21=^(${操作})<3,-1>$ => request(操作="$1") <0.4>;
export opt22=(${操作})<3,-1> => request(操作="$1") <0.2>;

export opt23=(${操作up})<3,-1> => request(操作="$1") <0.42>;


export opt172=(${操作})(一)?(个|点|首|曲|此|当前的?)?(音乐|歌曲|歌|专辑|MUSIC|单曲) => request(操作="$1") <0.22>;
export opt173=(音乐|歌曲|歌|单曲|曲子|乐曲)(${操作}) => request(操作="$2") <0.22>;
export opt174_1=^(一直放这首|就放这首|只放这首|只放这个|只听这首|只播这个|只播这首)(音乐|歌曲|歌)$ => request(操作="单曲循环",歌曲名="current",音乐类型="") <0.8>;
export opt174_2=^(单曲循环|单个循环)(这首)(音乐|歌曲|歌)$ => request(操作="单曲循环",歌曲名="current",音乐类型="") <0.8>;
export opt174_3=^(${操作})(音乐|歌曲|这首歌|歌)$ => request(操作="$1",歌曲名="",音乐类型="") <0.8>;
export opt174_4=^(${操作3})(这首)(音乐|歌曲|歌)$ => request(操作="$1",歌曲名="current",音乐类型="") <0.8>;
export musictengxun1_1=(这首)(歌|歌曲|曲子|音乐|单曲)(添加到|加到)(我的)?(歌单|收藏|曲库)   => request(操作="收藏") <0.3>;
export musictengxun1_1=(添加到|加到)(我的)?(歌单|收藏|曲库)   => request(操作="收藏",对象="音乐") <0.3>;
export musictengxun1_1=^我?(喜欢|好喜欢|很喜欢)(这首|这个|此|当前的?|这曲)(歌|歌曲|曲子|音乐)(${语气词})?$   => request(操作="收藏",歌曲名="") <0.6>;
export musictengxun1_1=(${来首}|播放|播|放)(一首|一曲|下|一下)?(我的|我)?(收藏列表|收藏|曲库|收藏歌曲|收藏夹|我喜欢的|我爱听的|我偏好的)(里|里的|的|里面的?|里头的?)?(所有|全部|所有的|全部的)?(歌|歌曲|曲子|音乐|曲儿)?(${语气词})?$   => request(对象="收藏列表",歌曲名="",播放列表="",音乐类型="",keywordflag="1") <0.6>;

export musictengxun1_1=(${来首}|播放|播|放)(一首|一曲|下|一下)?(我的|我)?(收藏列表|收藏|曲库|收藏歌曲|收藏夹|我喜欢|我爱听|我偏好)(里|里的|的|里面的?|里头的?)(${歌曲名})(这一?首|这|这一?个|这一?支)(歌|歌曲|曲子|音乐|曲儿)?(${语气词})?$ => request(对象="收藏列表",歌曲名="$6",播放列表="",音乐类型="",keywordflag="1") <0.6>;

export musictengxun1_1=(我要听|我想听)(一首|一曲|下|一下)?(我的|我)?(收藏列表|收藏|曲库|收藏歌曲|收藏夹|我喜欢的|我爱听的|我偏好的)(里|里的|的|里面的?|里头的?)?(所有|全部|所有的|全部的)?(歌|歌曲|曲子|音乐|曲儿)?(${语气词})?$   => request(对象="收藏列表",操作="收听",歌曲名="",播放列表="",音乐类型="",keywordflag="1") <0.6>;

##### by zhangyu #####
##### 操作的添加，联想需求 #####
export musiclianxiang1_1 = (${操作})(几|${整数})?(首|支|点) => request(操作="$1") <0.2>;
export opt174=^(${操作}).*(${对象}|${主题类型}) => request(操作="$1") <0.2>;
####by xn

    export song_new=(我要|我想|帮我)?把?(${风格}|${音乐类型}|${收藏music})(帮我|给我)?(${操作}) => request(操作="$4",keywordflag="1") <0.28>;
    export song_new1=(我要|我想|帮我)?(${操作_new})(到|为|至|成)(${风格}|${音乐类型}|${收藏music}) => request(操作="$2",keywordflag="1") <0.31>;
    export song_new2=(我要|我想|帮我)?把?(${收藏music})(帮我|给我)?(${操作}) => request(对象="$2",操作="$4",keywordflag="1") <0.38>;
    export song_new3=(我要|我想|帮我)?(${操作})我?的?(${收藏music}) => request(对象="$3",操作="$2",keywordflag="1") <0.31>;
    export song_new3=(我要|我想|帮我)?(听)我?的?(${收藏music}) => request(对象="$3",操作="收听",keywordflag="1") <0.30>;
    export song_new4=(我要|我想|帮我)?(${操作_new})(到|为|至|成)(我|我的)?(${收藏music}) => request(操作="$2",对象="$5",keywordflag="1") <0.32>;
    export song_new5=^(我|我的)?收藏的(歌|歌曲|曲子|音乐)$ => request(对象="收藏列表") <0.20>;
    export song_new6=把?(这首|此首|这个|这|这曲|此|当前的|当前)?(歌|歌曲|曲子|音乐)取消收藏 => request(操作="取消收藏") <0.22>;
    export song_new7=取消(这首|此首|这个|这|这曲|此|当前的|当前)?(歌|歌曲|曲子|音乐)的收藏 => request(操作="取消收藏") <0.22>;
    export song_new8=(取消收藏|不收藏)(这首|此首|这个|这|这曲|此|当前的|当前|我的)?(${对象}) => request(操作="取消收藏",对象="$3") <0.32>;


######yql
export opt_new=(我想|我要|我需要|我想要|想|要|想要)?(${操作})(几|${整数}|一|两)?(首|支|点|些|曲)?(${年代}|${音乐类型}|${场景})(经常|常)?(听|放|播放|播|点|唱)?的(歌|歌曲|曲子|音乐|单曲)?$ =>request(操作="$2")<0.3>;
export opt_new=(我想|我要|我需要|我想要|想|要|想要)?(${操作})(几|${整数}|一|两)?(首|支|点|些|曲)?(歌|歌曲|曲子|音乐|单曲)(${音乐类型})(听的|的)?$ =>request(操作="$2")<0.3>;
export opt_new=(${操作})(几|${整数}|一|两)?(点|些|首|曲|支|下)?(歌|歌曲|曲子|音乐|单曲)?(${年代}|${场景})(经常|常)?(听|放|播放|播|点|唱)?的 =>request(操作="$1")<0.1>;
export opt_new=^点(几|${整数}|一|两)?(些|首|曲|支|下)?(歌|歌曲|曲子|音乐|单曲)?(${年代}|${场景}|${音乐类型}|${排行榜})(经常|常)?(听|放|播放|播|点|唱)?的 =>request(操作="播放")<0.1>;
export opt_new=^点(几|${整数}|一|两)?(些|首|曲|支|下)?(歌|歌曲|曲子|音乐|单曲)?(${风格}|${音乐类型}|${排行榜})的 =>request(操作="播放")<0.1>;
export opt_new=(${操作})(几|${整数}|一|两)?(点|些|首|曲|支|下)?(歌|歌曲|曲子|音乐|单曲)?(${风格}|${音乐类型}|${排行榜})的 =>request(操作="$1")<0.1>;
export opt_new=(${操作})(几|${整数}|一|两)?(首|支|个|曲|些)?(${排行榜})的(歌|歌曲|音乐|曲子|曲儿|${对象})?$ => request(操作="$1") <0.2>;
export opt_new=^点(几|${整数}|一|两)?(首|支|个|曲|些)?(${排行榜})的(歌|歌曲|音乐|曲子|曲儿|${对象})?$ => request(操作="播放") <0.2>;


####腾讯1.5
obj_singer=歌手|明星|人|演唱者 =>("歌手名");
obj_version=版本;
obj_new=${obj_singer}|${obj_version};
export opt_new=^(换一个|换个|放别的|换别的|换其他|听其他)的?(${obj_new})(唱的|演唱的|的)?$ => request(操作="切换",对象="$2") <0.4>;
export opt_new=(换一个|换个)的?(${obj_version}) => request(操作="切换",对象="$2") <0.1>;
export opt_new=(换|听|放|播)(个|一个|点|一点)?(别的|其他|其他的)(${obj_new}) => request(操作="切换",对象="$4") <0.1>;
export opt_new=(换一个|换个|放别的|换别的|换其他|听其他)的?(${obj_singer})(唱的|演唱的) => request(操作="切换",对象="$2") <0.21>;
export opt_new=(${重复播放2})(${歌手_当前})唱的(${对象})?=> request(操作="$1",歌手名="$2",对象="$3") <0.41>;

####腾讯1.7 控制 by xy
##for bug
bug下一首1=(${不想}|别)(再)?(放|播放|播|听)(这|这首|这个|这支)=>("下一首");
export txmc_1=(${bug下一首1})(${音乐}) => request(操作="$1",对象="$2") <0.70>;
export txmc_2=不是(这歌|这首歌|这个歌) => request(操作="下一首") <0.75>;
export txmc_3_1=(换成|换|放|唱|播放)(${歌手名})(的|唱的|演唱的)(版本) => request(操作="切换",对象="$4") <0.3>;
export txmc_3_2=(唱)(${歌手名})(的|唱的|演唱的) => request(操作="播放") <0.3>;
export txmc_4=(${不想}|别)(再)?(放|播放|播|听)(${音乐})? => request(操作="暂停") <0.6>;
####腾讯1.8
export request1_1171=(${查询})(我的|当前|当前的|这个)?(播放列表)  => request(操作="$1",对象="$3") <0.3>;
export request1_1174=(看我的)(播放列表)=> request(歌曲名="") <0.4>;
export request1_1173=(播放列表)(里|里面|里头)?(有|还有)(哪些|什么)(歌|音乐|歌曲|曲子)=> request(操作="查询",对象="$1",播放列表="") <0.72>;
export request1_1174=(${播放}|听|来|点|${music_查找})(一|两|几)?(个|点|首|曲|支|些)?(${当前歌曲})(在|所在|所属|属于)?的?(专辑) => request(歌曲名="$4",对象="$6") <0.72>;
export request1_1175=(${播放}|听|来|点|${music_查找})(一|两|几)?(个|点|首|曲|支|些)?(这个|这|其他|当前的|当前|其它|别的)(专辑) => request(对象="$5") <0.42>;
export request1_1175=(${播放}|听|来|点|${music_查找})(一|两|几)?(个|点|首|曲|支|些)?(这专辑) => request(歌曲名="") <0.32>;

#####add by xuyang bug
export exitsingle_1=(退出|不要|别|不要再|别再)单曲循环了? => request(操作="单曲循环",__act__="deny",__tgt__="操作") <0.3>;
#####add by jk bug
export no_action=(${播放}|${music_查找})适合(${适用年龄})听的?(${风格}|${音乐类型}|${排行榜}|${儿童歌曲}|${幼儿歌曲})?$ => request(操作="$1") <0.2>;
###for 新手引导
xs_操作=(问|询问|查询|查找|查|查看)=>("");
xs_播放1=(听|收听)=>("");
xs_播放2=(放|播放|播) => ("播放");
xs_播放=${xs_播放1}|${xs_播放2};
xs_all操作=${xs_操作}|${xs_播放};
export xinshou1=^(${句首修饰词})?(告诉我|教我|教导我|指导我|我)?(我)?(一下)?要?(怎么|怎样|如何|怎么样)(可以)?(来)?(${xs_操作})(音乐|歌|儿歌|儿童歌曲)(${语气词})?$  => request(功能类型="新手引导",歌曲名="@",操作="$7") <0.5>;
export xinshou2=^(${句首修饰词})?(${xs_操作}|${xs_播放1})(你)?(音乐|歌|儿歌|儿童歌曲)(怎么|怎样|如何|可以吗|行吗)(问|说)?(告诉我|教我|教导我|指导我)?(一下)?(${语气词})?$ => request(功能类型="新手引导",歌曲名="@",操作="$2") <0.5>;
export xs_3=^(${句首修饰词})?你?(能|可以|能够)(告诉我|教我|教导我|指导我)(${xs_all操作})(音乐|歌|儿歌|儿童歌曲)(${语气词})?$ => request(功能类型="新手引导",歌曲名="@",操作="$4") <0.2>;
export xs_4=^(${句首修饰词})?(我)?(要怎么样|怎样|用什么方式)(可以)?(${xs_all操作})(音乐|歌|儿歌|儿童歌曲)(${语气词})?$ => request(功能类型="新手引导",歌曲名="@",操作="$5") <0.2>;
export xinshou1=^(${句首修饰词})?(告诉我|教我|教导我|指导我|我)?(一下)?要?(怎么|怎样|如何|怎么样)(可以)?(来)?(${xs_播放})(音乐|歌|儿歌|儿童歌曲)(${语气词})?$  => request(功能类型="新手引导",歌曲名="@",操作="$7") <0.5>;
export xinshou2=^(${句首修饰词})?(${xs_播放})(你)?(音乐|歌|儿歌|儿童歌曲)(怎么|怎样|如何|可以吗|行吗)(问|说)?(告诉我|教我|教导我|指导我)(一下)?(${语气词})?$ => request(功能类型="新手引导",歌曲名="@",操作="$2") <0.5>;
##export xs_3=^(${句首修饰词})?你?(能|可以|能够)(告诉我|教我|教导我|指导我)(${xs_all操作})(音乐|歌|儿歌|儿童歌曲)(${语气词})?$ => request(功能类型="新手引导",歌曲名="@",操作="$4") <0.2>;
##export xs_4=^(${句首修饰词})?(我)?(要怎么样|怎样|用什么方式)(可以)?(${xs_all操作})(音乐|歌|儿歌|儿童歌曲)(${语气词})?$ => request(功能类型="新手引导",歌曲名="@",操作="$5") <0.2>;

####听歌识曲
歌词找歌=(歌词找歌|歌词搜歌|歌词查歌|歌词识曲) =>("歌词找歌");
export 听歌识曲=^(给我|为我|开始|打开|开启|我要)?(听歌识曲|哼歌识曲|哼唱识曲|哼唱识别|哼歌识别|听歌识别)(${语气词}|可以吗|行吗)?$ => request(操作="$2") <0.7>;
export 歌曲识别=^(给我|为我|开始|打开|开启|我要)?(${歌词找歌})(${语气词}|可以吗|行吗)?$ => request(操作="$2") <0.7>;
#####add by xuyang
export domain_推荐=有(什么|啥|哪些)(歌|音乐|歌曲|歌谣|曲子)(可以|能够)听(${语气词})?$ => request(操作="推荐",对象="音乐") <0.8>;
#####add by jk for tx2.0
export domain_his_list_1=(之前|上次|上一次|上回|上一回|刚刚|刚才)(放|放过|听|听过|播|播过|播放|播放过)的(歌|歌曲|音乐)是(啥|什么)$ => request(对象="播放历史",主题="",歌曲名="@",操作="@") <0.6>;
export domain_his_list_2=(${播放}|${播放2})(我)?(之前|上次|上一次|上回|上一回|刚刚|刚才)(放|放过|听|听过|播|播过|播放|播放过)?的(歌|歌曲|音乐)$ => request(对象="播放历史",操作="$1",歌曲名="@",主题="") <0.6>;
export domain_his_list_3=(${播放})(一下)?(我的)?(播放历史)$ => request(对象="播放历史",操作="$1",歌曲名="@",主题="") <0.6>;
export school08=(${音乐类型})(${music_查找}) => request(音乐类型="$1",操作="$2") <0.1>;
export duix=^(播|播放|放|我想听|我要听|帮我放|给我放|替我放)?(我的)?(个性电台|私人FM|个性音乐|个人音乐)$ => request(对象="$3") <0.3>;

###xn
export school08=(${对象})(${music_查找}) => request(操作="$2") <0.2>;
#export bug1=(${播放}|${music_查找}|${操作up})(专辑)(${专辑名}) => request(专辑名="$3",操作="$1") <0.62>;
export bug1=(${播放}|${music_查找}|${操作up}|${操作})(${整数})?(首|个|支)?(专辑)(${专辑名}) => request(专辑名="$5",操作="$1") <0.62>;
export bug1=(${music_查找2})(${整数})?(首|个|支)?(专辑)(${专辑名}) => request(专辑名="$5",操作="查找") <0.62>;
export bug1=^(${句首修饰词})?(${播放}|${music_查找}|${操作up}|${操作}|查看)?(播放列表)(${语气词}|可以吗|行吗)?$ => request(对象="$3") <0.62>;
####add by caixiang for tx2.1
export oper_tx21_00=(${操作}|${播放})(${音源})(的)?(${mu_版}) => request(操作="$1",音源="$2",keyword="@")<0.4>;
export oper_tx21_00=(${操作}|${播放})(CD)(的)?(${mu_版}) => request(操作="$1",音源="$2",keyword="@",对象="")<0.401>;
export oper_tx21_01=^(我要听|我想听)(的是)?(${音源})(的)?(${mu_版}) => request(音源="$3",keyword="@")<0.4>;
export oper_tx21_02=^(我要听|我想听)(的不是)(${音源})(的)?(${mu_版}) => request(__act__="deny",音源="$3",keyword="@")<0.4>;
export oper_tx21_03=(不听|不想听|不要|不要听)(${音源})(的)?(${mu_版}) => request(__act__="deny",音源="$2",操作="@",keyword="@")<0.4>;
export oper_tx21_000=(${操作}|${播放})(${music_版本})(的)?(${mu_版})?的?(${语气词})?$ => request(操作="$1",版本="$2",keyword="@")<0.4>;
export oper_tx21_011=^(我要听|我想听)(的是)?(${music_版本})(的)?(${mu_版})?(${语气词})?$ => request(版本="$3",keyword="@")<0.4>;
export oper_tx21_022=^(我要听|我想听)(的不是)(${music_版本})(的)?(${mu_版}) => request(__act__="deny",版本="$3",keyword="@")<0.4>;
export oper_tx21_033=(不听|不想听|不要|不要听)(${music_版本})(的)?(${mu_版}) => request(__act__="deny",版本="$2",操作="@",keyword="@")<0.4>;
export oper_tx21_04=(${操作}|${播放})(${歌手名})(的|唱的|演唱的)?(${mu_版}) => request(操作="$1",歌手名="$2",keyword="@",对象="$4")<0.4>;
export oper_tx21_05=^(我要听|我想听)(的是)?(${歌手名})(的|唱的|演唱的)?(${mu_版}) => request(歌手名="$3",keyword="@")<0.4>;

export oper_tx21_06=(${操作}|${播放})(${歌手名})(的)?(${排行榜})(出|推出|发行|发)?(的)?(${对象}) => request(操作="$1",歌手名="$2",排行榜="$4",对象="$7",音源="")<0.4>;
export oper_tx21_061=^(${歌手名})(的)?(${排行榜})(出|推出|发行|发)?(的)?(${对象})$ => request(歌手名="$1",排行榜="$3",对象="$6",音源="")<0.7>;
export oper_tx21_07=(${操作}|${播放})(${歌手名})(${_日期})(的)?(出|推出|发行|发)?(的)?(${对象}) => request(操作="$1",歌手名="$2",日期="$3",对象="$7",音源="")<0.4>;
export oper_tx21_071=^(${歌手名})(${_日期})(的)?(出|推出|发行|发)?(的)?(${对象})$ => request(歌手名="$1",日期="$2",对象="$6",音源="")<0.4>;

export oper_tx21_08=(${操作}|${播放})(${语种}|${影视语种})(${主题})?(的)?(${对象}) => request(操作="$1",语种="$2",主题="$3",对象="$5")<0.4>;

## by zhangyu, bug-fix, 有个知名的节目名就叫"歌手"
export oper_tx21_09=(${操作}|${播放})(${语种}|${影视语种})的?(歌手|歌者)(的)?(${对象}) => request(操作="$1",语种="$2",主题="",对象="$5")<0.42>;

##extension
export ext_tx21_00=^(${句首修饰词})?(${播放})(${语种})(的)?(${音乐类型})(乐|音乐|歌|歌曲|的)(${语气词})?$ => request(操作="$2",语种="$3",音乐类型="$5")<0.4>;
export ext_tx21_01=^(${句首修饰词})?(${播放})(${音乐类型})(乐|音乐|歌|歌曲|的)(${语种})(的|版的)(${语气词})?$ => request(操作="$2",语种="$5",音乐类型="$3")<0.4>;
export ext_tx21_02=^(${句首修饰词})?(${播放})(${场景})(的|的时候听的|听的)(${音乐类型})(乐|音乐|歌|歌曲|的)(${语气词})?$ => request(操作="$2",音乐场景="$3",音乐类型="$5")<0.4>;
export ext_tx21_03=^(${句首修饰词})?(${播放})(${音乐类型})(乐|音乐|歌|歌曲|的)(${场景})(的时候听的|听的)(${语气词})?$ => request(操作="$2",音乐场景="$5",音乐类型="$3")<0.7>;
export ext_tx21_04=^(${句首修饰词})?(${播放})(${歌手性别})(的|唱的|演唱的|版本的)(${音乐类型})(乐|音乐|歌|歌曲|的)(${语气词})?$ => request(操作="$2",性别="$3",音乐类型="$5")<0.4>;
export ext_tx21_05=^(${句首修饰词})?(${播放})(${音乐类型})(乐|音乐|歌|歌曲|的)(${歌手性别})(的|唱的|演唱的|版本的)(${语气词})?$ => request(操作="$2",性别="$5",音乐类型="$3")<0.4>;
export ext_tx21_06=^(${句首修饰词})?(${播放})(适合)?(${风格})(的|的时候听的|时听的)(${音乐类型})(乐|音乐|歌|歌曲|的)(${语气词})?$ => request(操作="$2",风格="$4",音乐类型="$6")<0.4>;
export ext_tx21_07=^(${句首修饰词})?(${播放})(${音乐类型})(乐|音乐|歌|歌曲|的)(适合)?(${风格})(的|的时候听的|时听的)(${语气词})?$ => request(操作="$2",风格="$6",音乐类型="$3")<0.4>;
export ext_tx21_08=^(${句首修饰词})?(${播放})(${歌手性别})(的|唱的|演唱的|版本的)(${语种})(的|版的)(${对象})?(${语气词})?$ => request(操作="$2",性别="$3",语种="$5")<0.4>;
export ext_tx21_09=^(${句首修饰词})?(${播放})(${歌手性别})(的|唱的|演唱的|版本的)(${语种})歌(${语气词})?$ => request(操作="$2",性别="$3",语种="$5")<0.4>;
export ext_tx21_010=^(${句首修饰词})?(${播放})(${歌手性别})(的|唱的|演唱的|版本的)(${场景})(的|的时候听的|听的)(歌|音乐)?(${语气词})?$ => request(操作="$2",性别="$3",音乐场景="$5")<0.4>;
export ext_tx21_011=^(${句首修饰词})?(${播放})(${场景})(的|的时候听的|听的)(${歌手性别})(的|唱的|演唱的|版本的)(歌|音乐)?(${语气词})?$ => request(操作="$2",音乐场景="$3",性别="$5")<0.4>;
export ext_tx21_012=^(${句首修饰词})?(${播放})(适合)?(${风格})(的|的时候听的|时听的)(${场景})(的|的时候听的|听的)(歌|音乐)?(${语气词})?$ => request(操作="$2",风格="$4",音乐场景="$6")<0.4>;
export ext_tx21_013=^(${句首修饰词})?(${播放})(${场景})(的|的时候听的|听的|的音乐)(${风格})(的|的时候听的|时听的)(歌|音乐)?(${语气词})?$ => request(操作="$2",音乐场景="$3",风格="$5")<0.4>;
export ext_tx21_014=^(${句首修饰词})?(${播放})(${语种})(的)?(适合)?(${风格})(的|的时候听的|时听的)(歌|音乐)?(${语气词})?$ => request(操作="$2",语种="$3",风格="$6")<0.4>;
export ext_tx21_015=^(${句首修饰词})?(${播放})(适合)?(${风格})(的|的时候听的|时听的)(${语种})(的|版的)(歌|音乐)?(${语气词})?$ => request(操作="$2",风格="$4",语种="$6")<0.4>;
export ext_tx21_016=^(${句首修饰词})?(${播放})(适合)?(${风格})(的|的时候听的|时听的)(${语种})歌(${语气词})?$ => request(操作="$2",风格="$4",语种="$6")<0.4>;
export ext_tx21_017=^(${句首修饰词})?(${播放})(适合)?(${风格})(的|的时候听的|时听的)(歌|音乐)?(${语种})(的|版的)(${语气词})?$ => request(操作="$2",风格="$4",语种="$7")<0.4>;
export ext_tx21_018=^(${句首修饰词})?(${播放})(适合)?(${风格})(的|的时候听的|时听的)(${歌手性别})(的|唱的|演唱的|版本的)(歌|音乐)?(${语气词})?$ => request(操作="$2",风格="$4",性别="$6")<0.4>;
export ext_tx21_019=^(${句首修饰词})?(${播放})(${歌手性别})(的|唱的|演唱的|版本的)(适合)?(${风格})(的|的时候听的|时听的)(歌|音乐)?(${语气词})?$ => request(操作="$2",风格="$6",性别="$3")<0.4>;
export ext_tx21_020=^(${句首修饰词})?(${播放})(${歌手性别})(的|唱的|演唱的|版本的)(歌|音乐)?(适合)?(${风格})(的|的时候听的|时听的)(${语气词})?$ => request(操作="$2",风格="$7",性别="$3")<0.4>;
export ext_tx21_021=^(${句首修饰词})?(${播放})(${语种})(的)?(适合)?(${场景})(的|的时候听的|听的)(歌|音乐)?(${语气词})?$ => request(操作="$2",语种="$3",音乐场景="$6")<0.4>;
export ext_tx21_022=^(${句首修饰词})?(${播放})(适合)?(${场景})(的|的时候听的|听的)(歌|音乐)?(${语种})(的|版的)(${语气词})?$ => request(操作="$2",音乐场景="$4",语种="$7")<0.4>;
export ext_tx21_023=^(${句首修饰词})?(${播放})(适合)?(${场景})(的|的时候听的|听的)(${语种})(的|版的)(歌|音乐)?(${语气词})?$ => request(操作="$2",音乐场景="$4",语种="$6")<0.4>;
export ext_tx21_024=^(${句首修饰词})?(${播放})(适合)?(${场景})(的|的时候听的|听的)(${语种})歌(${语气词})?$ => request(操作="$2",音乐场景="$4",语种="$6")<0.4>;
export ext_tx21_025=^(${句首修饰词})?(${播放})(适合)?(${场景})(的|的时候听的|听的)(${乐器})(的|演奏的|版的|曲)(${语气词})?$ => request(操作="$2",音乐场景="$4",乐器="$6")<0.4>;
export ext_tx21_026=^(${句首修饰词})?(${播放})(${乐器})(的|演奏的|版的)(适合)?(${场景})(的|的时候听的|听的)(歌|音乐)?(${语气词})?$ => request(操作="$2",乐器="$3",音乐场景="$6")<0.4>;
export ext_tx21_027=^(${句首修饰词})?(${播放})(${乐器})(的|演奏的|版的)(曲子|音乐)?(适合)?(${场景})(的|的时候听的|听的)(${语气词})?$ => request(操作="$2",乐器="$3",音乐场景="$7")<0.4>;
export ext_tx21_028=^(${句首修饰词})?(${播放})(${乐器})曲(适合)?(${场景})(的|的时候听的|听的)(${语气词})?$ => request(操作="$2",乐器="$3",音乐场景="$5")<0.4>;
export ext_tx21_029=^(${句首修饰词})?(${播放})(适合)?(${风格})(的|的时候听的|时听的)(${乐器})(的|演奏的|版的)(曲子|音乐)?(${语气词})?$ => request(操作="$2",风格="$4",乐器="$6")<0.4>;
export ext_tx21_030=^(${句首修饰词})?(${播放})(适合)?(${风格})(的|的时候听的|时听的)(${乐器})曲(${语气词})?$ => request(操作="$2",风格="$4",乐器="$6")<0.4>;
export ext_tx21_031=^(${句首修饰词})?(${播放})(${乐器})(的|演奏的|版的)(曲子|音乐)?(适合)?(${风格})(的|的时候听的|时听的)(${语气词})?$ => request(操作="$2",乐器="$3",风格="$7")<0.4>;
export ext_tx21_032=^(${句首修饰词})?(${播放})(${乐器})曲(适合)?(${风格})(的|的时候听的|时听的)(${语气词})?$ => request(操作="$2",乐器="$3",风格="$5")<0.4>;
export ext_tx21_033=^(${句首修饰词})?(${播放})(${乐器})(的|演奏的|版的)(适合)?(${风格})(的|的时候听的|时听的)(曲子|音乐)?(${语气词})?$ => request(操作="$2",乐器="$3",风格="$6")<0.4>;
export ext_tx21_034=^(${句首修饰词})?(${播放})(${年代})(的)?(${歌手性别})(的|唱的|演唱的|版本的)(歌|音乐)?(${语气词})?$ => request(操作="$2",年代="$3",性别="$5")<0.4>;
export ext_tx21_035=^(${句首修饰词})?(${播放})(${歌手性别})(的|唱的|演唱的|版本的)(歌|音乐)?(${年代})(的)?(${语气词})?$ => request(操作="$2",年代="$6",性别="$3")<0.4>;
export ext_tx21_036=^(${句首修饰词})?(${播放})(${歌手性别})(的|唱的|演唱的|版本的)(${年代})的(歌|音乐)?(${语气词})?$ => request(操作="$2",年代="$5",性别="$3")<0.4>;
##

export kz_tx21_00=^(${适用人群1})?(${退出2})(${音乐类型})(了)?(${语气词})?$ => request(适用人群="$1",__act__="",__tgt__="",操作="$2",歌曲名="@",歌手名="@")<0.4>;
export kz_tx21_00=^(我|我们|大家)(${退出2})(${音乐类型})(了)?(${语气词})?$ => request(__act__="",__tgt__="",操作="$2",歌曲名="@",歌手名="@")<0.4>;
export kz_tx21_01=^(${适用人群1})?(${spec切换})(${音乐类型})?(了)?(${语气词})?$ => request(适用人群="$1",__act__="",__tgt__="",操作="$2",歌曲名="@",歌手名="@")<0.81>;
export kz_tx21_01=^(我|我们|大家)(${spec切换})(${音乐类型})?(了)?(${语气词})?$ => request(__act__="",__tgt__="",操作="$2",歌曲名="@",歌手名="@")<0.81>;
export bug_tx21_00=(${播放})(${音源})上的(${对象})(${语气词})?$ => request(操作="$1",音源="$2",对象="$3")<0.41>;
####
###add by jk for bug
export tx_21_5=(不想|不要|不想要|取消)(再|继续)?(${操作up})了?(${语气词})?$ => request(操作="$3",__act__="deny",__tgt__="操作") <0.61>;

##故事机20170920
export cz0920=(${播放}|${停止}|${暂停}|${退出}|${继续}|${顺序播放}|${循环播放}|${随机播放}|${单曲循环}|${重复播放})(${儿童歌曲}) => request(操作="$1")<0.32>;

####xiatian

export opt_bofang_xt_01=^(${句首修饰词})?(${播放})(一首|一支|一曲|首|曲|支|个|一个|一下|下|点|一点|些|一些)?(本地|离线)?(的)?(播放器)?(里面|里|内|内部|的)?(的)?(歌|歌曲|音乐|曲子|乐曲)(${请求语气词结尾})?$ => request(操作="$2")<0.5>;
export opt_bofang_xt_02=^(本地|离线)(的)?(播放器)?(里面|里|里头|内|内部|的)?(的)?(${音乐})(${句首修饰词})?(${播放})(下|一下|一首|一支|一曲|首|曲|支|个|一个|点|一点|些|一些)?(${请求语气词结尾})?$ => request(操作="播放")<0.5>;
export opt_qiehuan_xt_01=^(${句首修饰词})?(切换|切|换)(个|曲|支|首)?(歌|歌曲|音乐|曲子|乐曲)(${请求语气词结尾})?$ => request(操作="下一首")<0.5>;
export opt_qiehuan_xt_02=^(这)(首|个|支)?(歌|歌曲|音乐|曲子|乐曲)(${句首修饰词})?(${不想}|别)(听|放|播放|播)了?(${请求语气词结尾})?$ => request(操作="下一首")<0.61>;
export opt_danquxunhuan_xt=^(${句首修饰词})?单曲播放(${语气词}|${请求语气词结尾})?$ => request(操作="单曲循环",对象="") <0.4>;
### aicar6.0 add by xt
export qiehuan_xt_60 = ^(${句首修饰词})?(${切换_xt})(${歌手名})的(${歌曲名})(${句末听听类动词_xt}|${语气词})?$ => request(操作="$2",歌手名="$3",歌曲名="$4")<0.6>;
export qiehuan2_xt_60 = ^(${句首修饰词})?(${切换_xt})(${歌手名})的歌(${句末听听类动词_xt}|${语气词})?$ => request(操作="$2",歌手名="$3")<0.6>;
export qiehuan3_xt_60 = ^(${句首修饰词})?(${切换_xt})(${音乐类型})(${音乐})?(${句末听听类动词_xt}|${语气词})?$ => request(操作="$2",音乐类型="$3",对象="$4")<0.6>;
export qiehuan4_xt_60 = ^(${句首修饰词})?(${切换_xt})(${语种})(${音乐})(${句末听听类动词_xt}|${语气词})?$ => request(操作="$2",语种="$3",对象="$4")<0.6>;
export qiehuan5_xt_60 = ^(${句首修饰词})?(${切换_xt})(${风格})的?(${音乐})(${句末听听类动词_xt}|${语气词})?$ => request(操作="$2",风格="$3",对象="$4")<0.6>;

## bug_fix, by zhangyu 2018-07-17
export bug_fix_001 = ^(好的|确认|确定)(${句首修饰词})?(${播放})(${语气词})?$ => request(操作="$3",__act__="affirm",歌曲名="@")<0.6>;



# add by kun.meng   2018-08-29
export bug_1_mk=^(${句首修饰词})?(${操作}|${播放}|${播放2}|${music_查找1})(首|个|一首|一个)?(比较|较|温柔的|唯美的|唯美|深情|清新)(${风格})?(的|点的)?(曲|小曲|铃声|歌儿|歌)?(${语气词})?$=> request(操作="$2",歌曲名="@",风格="$5") <0.52>;
export bug_2_mk=^(${句首修饰词})?(${操作}|${播放}|${播放2}|${music_查找1})(首|个|一首|一个)?(${风格})(的|点的)?(${语种})?(的)?(${音乐}|单曲)$=> request(操作="$2",歌曲名="@",风格="$4") <0.32>;
export bug_3_mk=^(${句首修饰词})?(${操作}|${播放}|${播放2}|${music_查找1})(首|个|一首|一个)?(很好听的)?(${音乐类型})$=> request(操作="$2",歌曲名="@",音乐类型="$5") <0.52>;
export bug_4_mk=^(在吗)(${操作})(首|个|一首|一个)?(${风格})?(的)?(${音乐})?(${句末听听类动词_xt})?(${语气词})?$=> request(操作="$2",歌曲名="@") <0.42>
export bug_5_mk=^(我想听|我要听|${来首}|播放|${music_查找})(一下|下)?(电视|电视剧)?(${主题})(节目)?(中|里|里面|里头)?的?(${主题类型}|音乐|歌曲|歌|曲子|单曲)$=> request(歌曲名="@") <0.32>;
export bug_6_mk=^(${句首修饰词})?(我|我们|咱|咱们|俺|俺们|爷|大爷|老子|朕|宝宝|本宝宝)(现在|今儿|今个|今天|目前)?(想听|要听)(${歌曲名})(这首歌|这首歌曲)(麻烦|请)?(你|替我|为我|帮我|给我)?(${music_查找})(一下|下)(${句末听听类动词_xt}|${语气词})?$=> request(歌曲名="$5"，操作="$9") <0.32>;


# add by wjz 20190506
w_单曲循环 = (${重复播放2})这(首|支|个|曲)?  => ("单曲循环");
w_循环播放 = (${重复播放2})(这些)?  => ("循环播放");
w_重复播放 = (${w_单曲循环})|(${w_循环播放});
export opt_1_w=(${w_重复播放})(儿歌)=> request(操作="$1",对象="$3") <0.35>;

## by zhangyu, 2019-08-12 
export bug1_zy = (${播放})我?(原来|原先|原本|原来)(就有)?的?(${音源})(上|里)?的?(${音乐})(${语气词})?$ => (歌曲名="@", 音源="$4") <0.1>;
export bug1_zy = ^(${句首修饰词})?(${播放})(${歌手名})的?(${音乐})的?(${music_版本})(的)?(${mu_版})(${语气词})?$ => (歌曲名="@", 版本="$5") <0.35>;
export bug1_zy = ^(${句首修饰词})?(${播放})(${歌手名})的?(${music_版本})(的)?(${mu_版})的?(${音乐})(${语气词})?$ => (歌曲名="@", 版本="$4") <0.45>;
export bug2_zy = (唱|歌唱|唱歌)(一|几|两|俩)?(首|支|曲|个)?(${歌曲名}|歌|歌曲|音乐)(给我|为我|给我们|给咱)(听|听一听) => request(操作="演唱") <0.22>;

# add by wjz 20190820
export opt_2_w=^(${当前歌曲})(可|可真|可真是|真是)?(很|太)?(难听|不好听)(${语气词})?$=> request(操作="切换",歌曲名="@") <0.35>;

