export album=^(播放|我想听|我要听|给我放|来首|来一首|换首|换一首|听首|听一首|放首|放一首|播一首)?(下|个|一下|一个|首|一首)?(专辑)(${专辑名})(里|里面|中)的(${对象})$=> request(专辑名="$2",歌曲名="") <0.2>;
export album1=(专辑)(${专辑名}) => request(专辑名="$2") <0.11>;
export album1=(${专辑名})(这张|这个)?(专辑|CD) => request(专辑名="$1") <0.1>;
export album12=(播放|我想听|我要听|给我放)(下|个|一下|一个|首|一首)?(专辑|CD)(${专辑名})$ => request(专辑名="$4",crfflag="0") <0.6>;
export album13=(播放|我想听|我要听|给我放|来首|来一首|换首|换一首|听首|听一首|放首|放一首|播一首)(下|个|一下|一个|首|一首)?(这张|这个)?(专辑)(${专辑名})(里|里面)?的?(歌曲|歌|曲子|音乐)$ => request(专辑名="$5",crfflag="0",__act__="inform",__tgt__="@") <0.61>;
export album14=(播放|我想听|我要听|给我放|来首|来一首|换首|换一首|听首|听一首|放首|放一首|播一首)(下|个|一下|一个|首|一首)?(这张|这个)?(专辑)(${专辑名})(里|里面)?的?(${歌曲名})$ => request(专辑名="$5",歌曲名="$7",crfflag="0") <0.6>;
export album15=(播放|我想听|我要听|给我放)(下|个|一下|一个|首|一首)?(${歌手名})的(这张|这个)?(专辑|CD)(${专辑名})$ => request(专辑名="$6",歌手名="$3",crfflag="0") <0.6>;
export album1_1=(播放|我想听|我要听|给我放|播|放|听)(下|个|一下|一个|首|一首)?(${歌手名})(演唱|唱)?的(这张|这个)?(专辑|CD)(${专辑名})$ => request(专辑名="$7",歌手名="$3",crfflag="0") <0.6>;


export album1=(播放|我想听|我要听|给我放|来首|来一首|换首|换一首|听首|听一首|放首|放一首|播一首)(下|个|一下|一个|首|一首)?(${专辑名})(这张|这个)?(专辑|CD)(里|里面)?的?(歌曲|歌|曲子|音乐)$ => request(专辑名="$3",crfflag="0") <0.6>;
export album1=(播放|我想听|我要听|给我放|来首|来一首|换首|换一首|听首|听一首|放首|放一首|播一首)(下|个|一下|一个|首|一首)?(${专辑名})(这张|这个)?(专辑|CD)(里|里面)?的?(${歌曲名})$ => request(专辑名="$3",歌曲名="$7",crfflag="0") <0.6>;
export album1=(播放|我想听|我要听|给我放)(下|个|一下|一个|首|一首)?(${歌手名})的(这张|这个)?(专辑|CD)(${专辑名})$ => request(专辑名="$6",歌手名="$3",性别="",crfflag="0") <0.6>;
export album1=(播放|我想听|我要听|给我放)(下|个|一下|一个|首|一首)?(${歌手名})的(${专辑名})(这张|这个)?(专辑|CD)$ => request(专辑名="$4",歌手名="$3",crfflag="0") <0.6>;

export album1=^(帮我|替我|给我|我要|我想)?(听|放|点|播)(下|个|一下|一个|首|一首)?(这张|这个)?(专辑|CD)(${专辑名})$ => request(专辑名="$6",crfflag="0") <0.6>;
export album1=^(帮我|替我|给我|我要|我想)?(听|放|点|播)(下|个|一下|一个|首|一首)?(这张|这个)?(专辑|CD)(${专辑名})(里|里面)?的?(歌曲|歌|曲子|音乐)$ => request(专辑名="$6",crfflag="0") <0.6>;
export album1=^(帮我|替我|给我|我要|我想)?(听|放|点|播)(下|个|一下|一个|首|一首)?(这张|这个)?(专辑|CD)(${专辑名})(里|里面)?的?(${歌曲名})$ => request(专辑名="$6",歌曲名="$8",crfflag="0") <0.6>;
export album1=^(帮我|替我|给我|我要|我想)?(听|放|点|播)(下|个|一下|一个|首|一首)?(${歌手名})的(这张|这个)?(专辑|CD)(${专辑名})$ => request(专辑名="$7",歌手名="$4",crfflag="0") <0.6>;

export album1=^(帮我|替我|给我|我要|我想)?(听|放|点|播)(下|个|一下|一个|首|一首)?(${专辑名})(这张|这个)?(专辑|CD)(里|里面)?的?(歌曲|歌|曲子|音乐)$ => request(专辑名="$4",crfflag="0") <0.6>;
export album1=^(帮我|替我|给我|我要|我想)?(听|放|点|播)(下|个|一下|一个|首|一首)?(${专辑名})(这张|这个)?(专辑|CD)(里|里面)?的?(${歌曲名})$ => request(专辑名="$4",歌曲名="$8",crfflag="0") <0.6>;
export album1=^(帮我|替我|给我|我要|我想)?(听|放|点|播)(下|个|一下|一个|首|一首)?(${歌手名})的(这张|这个)?(专辑|CD)(${专辑名})$ => request(专辑名="$7",歌手名="$4",crfflag="0") <0.6>;
export album1=^(帮我|替我|给我|我要|我想)?(听|放|点|播)(下|个|一下|一个|首|一首)?(${歌手名})的(${专辑名})(这张|这个)?(专辑|CD)$ => request(专辑名="$5",歌手名="$4",crfflag="0") <0.6>;
export album1=^(帮我|替我|给我|我要|我想)?(听|放|点|播|播放|来首|来一首)(下|个|一下|一个|首|一首)?(${歌手名})的?(${专辑名})(这张|这个)?(专辑|CD)(的|里的|里面的)?(${歌曲名})$ => request(专辑名="$5",歌手名="$4",crfflag="0",歌曲名="$9") <0.61>;
export album1=^(帮我|替我|给我|我要|我想)?(听|放|点|播)(下|个|一下|一个|首|一首)?(${专辑名})(这张|这个)?(专辑|CD)$ => request(专辑名="$4",crfflag="0") <0.4>;
export album1=(播放|我想听|我要听|给我放|来首|来一首|换首|换一首|听首|听一首|放首|放一首|播一首)(下|个|一下|一个|首|一首)?(${专辑名})(这张|这个)?(专辑|CD)$ => request(专辑名="$3",crfflag="0") <0.6>;
export album1=^(帮我|替我|给我|我要|我想)?(听|放|点|播|播放|我想听|我要听|给我放|来首|来一首|来|换首|换一首|听首|听一首|放首|放一首|播一首)(下|个|一下|一个|首|一首)?(这张|这个|一张)?(专辑|CD)(${歌手名})的(${专辑名})$ => request(专辑名="$7",歌手名="$6",crfflag="0") <0.61>;
export album1=(${歌手名})的(这张|这个|一张)?(专辑|CD)(${专辑名})$ => request(专辑名="$4",歌手名="$1",crfflag="0") <0.41>;
export album1=(${歌手名})的(${专辑名})(这张|这个|一张)?(专辑|CD)$ => request(专辑名="$2",歌手名="$1",crfflag="0") <0.41>;
#export album=(${专辑名})的(${歌曲名})$=> request(专辑名="$1",歌曲名="$2",crfflag="0") <0.41>;
export album=(${专辑名})专辑里的(${对象})?$=> request(专辑名="$1",crfflag="0") <0.21>;
export album=^(播放|我想听|我要听|给我放|来首|来一首|换首|换一首|听首|听一首|放首|放一首|播一首|播|放)(下|个|一下|一个|首|一首)?(${对象})(${专辑名})(专辑)(里|里面|中)的$=> request(专辑名="$4",歌曲名="") <0.6>;

####add by xuyang bug
export album_bug1=^(播放|我想听|我要听|给我放|来首|来一首|换首|换一首|听首|听一首|放首|放一首|播一首|播|放)(下|个|一下|一个|首|一首)?(${歌手名})?的?(${专辑名})专辑(里的|中的|里面的|的)(${歌曲名})(${语气词}|行吗|行不|行不行|可以吗|可不可以|可以不)?$ => request(专辑名="$4",歌曲名="$6",crfflag="0") <0.41>;
export album_bug1=^(播放|我想听|我要听|给我放|来首|来一首|换首|换一首|听首|听一首|放首|放一首|播一首|播|放)(下|个|一下|一个|首|一首)?(${歌手名})的?(${专辑名})(里的|中的|里面的|的)(${歌曲名})(${语气词}|行吗|行不|行不行|可以吗|可不可以|可以不)?$ => request(专辑名="$4",歌曲名="$6",crfflag="0") <0.41>;
export album_bug1=^(${歌手名})的?(${专辑名})(里的|中的|里面的|的)(${歌曲名})(${语气词}|行吗|行不|行不行|可以吗|可不可以|可以不)?$ => request(专辑名="$2",歌曲名="$4",crfflag="0") <0.41>;

##add by jk for bug
export album_bug2=^(帮我|替我|给我|我要|我想)?(${播放})(下|个|一下|一个|首|一首)?(专辑|CD)(${专辑名})(里的|中的|里面的|的)?(歌曲|歌|曲子|音乐)?(${语气词}|行吗|行不|行不行|可以吗|可不可以|可以不)?$ => request(专辑名="$5",歌曲名="@",主题="@") <0.45>;
export album_bug3=^(帮我|替我|给我|我要|我想)?(${播放})(下|个|一下|一个|首|一首)?(专辑|CD)?(${专辑名})(里的|中的|里面的)(歌曲|歌|曲子|音乐)?(${语气词}|行吗|行不|行不行|可以吗|可不可以|可以不)?$ => request(专辑名="$5",歌手名="@",歌曲名="@",主题="@") <0.45>;

