export theme1=^(${主题})$ => request(主题="$1") <0.1>;
export theme2=(${歌手名})在?(${主题}) => request(主题="$2") <0.1>;
export songname3=(我想听|我要听|${来首}|播放|${music_查找})(一下|下)?(电影|电视剧|电视)?(${主题})(节目)?(里|里面|里头)?的?(儿歌|音乐|歌曲|歌|曲子)$ => request(主题="$4",歌曲名="") <0.8>;
export songname32=(我想听|我要听|${来首}|播放|${music_查找})(一下|下)?(电影|电视剧|电视)?(${主题})(节目)(里|里面|里头)?的?(${主题类型})$ => request(主题="$4",歌曲名="") <0.8>;
export songname33=(我想听|我要听|${来首}|播放|${music_查找})(一下|下|首|一首)?(${主题})(节目)?(里|里面|里头)?的(儿歌|音乐|歌曲|歌|曲子) => request(主题="$3",歌曲名="") <0.7>;
export songname34=(我想听|我要听|${来首}|播放|${music_查找})(一下|下|首|一首)?(${主题})(里|里面|里头)?的(歌词) => request(主题="") <0.71>;
export songname35=(我想听|我要听|${来首}|播放|${music_查找})(一下|下)?(${主题})(节目)?(里|里面|里头)?的?(${主题类型}|音乐|歌曲|歌|曲子|单曲) => request(主题="$3") <0.7>;

export songname36=^(电影|电视剧|节目)?(${主题})(里|里面|里头)?的?(音乐|歌曲|歌|曲子|${主题类型})(${语气词})?$ => request(主题="$2",歌曲名="") <0.7>;
export songname36=(${主题})(里|里面|里头)?的?(音乐|歌曲|歌|曲子|${主题类型}) => request(主题="$1") <0.4>;
export theme37=(${主题})的?(${排行榜}) => request(主题="$1",排行榜="$2") <0.2>;
###### modified by caixiang
export theme41=(${来首}|${来首2}|${播放2}|${播放})(${主题类型}) => request(主题类型="$2") <0.4>;
#####add by caixiang for unsupported
export supp_fix=(${操作}|${m来些2})(${主题})$ => request(主题="$2") <0.19>;
#####add by jk for tx2.0
export songname51=(我想听|我要听|${来首}|播放|${music_查找}|${播放})(一下|下)?(${主题})的?(专辑|碟|歌单)$ => request(主题="$3") <0.7>;
export songname62=(${主题})的?(专辑|碟|歌单)$ => request(主题="$1") <0.7>;

## by zhangyu, 2019-08-12
export zhuti1 = (我想听|我要听|${来首}|播放|${music_查找}|${播放})(一下|下)?(${主题})的?(全部|所有)?的?(音乐|歌曲|歌|单曲|歌单)$ => request(主题="$3") <0.6>;

