歌曲数量1=(放|播放|播|来|点|听)(${整数})(首|曲|支|个) => ("$2");
歌曲数量2=(放|播放|播|来|点|听)(首|支|个) => ("1");
歌曲数量3=(放|播放|播|来|点|听)一?(些) => ("more");
歌曲数量4=(放|播放|播|来|听)一?(点) => ("more");
歌曲数量5=(放|播放|播|来|点|听)几(首|曲|支|个) => ("more");
#歌曲数量6=(放|播放|播|来|点)(曲)[^子] => ("1");
歌曲数量7=(找|搜|搜索)一?(些|点) => ("more");
#歌曲数量=${歌曲数量1}|${歌曲数量2}|${歌曲数量3}|${歌曲数量4}|${歌曲数量5}|${歌曲数量6};
歌曲数量=${歌曲数量1}|${歌曲数量2}|${歌曲数量3}|${歌曲数量4}|${歌曲数量5};
歌曲数量n1=(找|搜|搜索)(${整数})(首|曲|支|个) => ("$2");
歌曲数量n2=(找|搜|搜索)几(首|曲|支|个) => ("more");
歌曲数量n3=(找|搜|搜索)一?(点|些) => ("more");
歌曲数量n4=(找|搜|搜索)个 => ("1");
歌曲数量n_all=${歌曲数量n1}|${歌曲数量n2}|${歌曲数量n3}|${歌曲数量n4};

export 操作1=(${歌曲数量})=> request(歌曲数量="$1") <0.22>;
###xn bug
export 操作12=(听|推荐)(${整数})(首|曲|支|个)(那个|.{2,12})?歌单=> request(歌曲数量="") <0.22>;
export shuliang12=(放|播放|播|来|听|推荐|找|搜|搜索)(${歌曲名})(${语气词})?$=> request(歌曲数量="") <0.221>;

###
export 操作12=(听|推荐)(${整数})(首|曲|支|个)=> request(歌曲数量="$2") <0.21>;
#歌曲数量8=(听|找)(首|支) => ("1");
export 操作13=(听|找)(首|支|个)=> request(歌曲数量="1") <0.2>;
#歌曲数量9=(听|找)(曲)[^子] =>("1");
#export 操作14=(${歌曲数量9})=> request(歌曲数量="$1") <0.2>;
歌曲数量10=(听|找)一?(些|点|几首|几曲)(别的|其他的)? =>("more");
export 操作15=(${歌曲数量10})=> request(歌曲数量="$1") <0.51>;
#歌曲数量11=推荐(几首|几曲) =>("more");
export 操作16=推荐(几首|几曲)=> request(歌曲数量="more") <0.51>;
export 操作27=(${歌曲数量7})=> request(歌曲数量="$1") <0.51>;
export 操作12=(${歌曲数量n_all})=> request(歌曲数量="$1") <0.31>;

###add by caixiang for tx2.1

###
