export 适用人群1=(给|为)(${适用人群1})(${播放}|${播放2}|${m来些2})(段|一段)?(适合)?(${场景})?(的|听的|时的|时听的)?(歌|歌曲|音乐|曲子) => request(适用人群="$2",歌曲名="@") <0.4>;
export 适用人群2=(给|为)(${适用人群1})(${播放}|${播放2}|${music_查找1}) => request(适用人群="$2",操作="$3",歌手名="@",歌曲名="@") <0.3>;
export 适用人群2=(给|为)(${适用人群1})(找|听) => request(适用人群="$2",歌手名="@",歌曲名="@") <0.3>;
export 适用人群3=(${播放}|${播放2}|${music_查找})(适合)?(${适用年龄})的?(${适用人群1}) => request(适用年龄="$3",适用人群="$4",操作="$1",歌手名="@",歌曲名="@") <0.2>;
export 适用人群4=(${适用人群1})(能|能够|想|想要|要|可以|喜欢|爱)听 => request(适用人群="$1",歌手名="@",歌曲名="@") <0.21>;
export 适用人群5=(${播放}|${播放2}|${music_查找})?(适合)?(${适用人群1})(能|能够|想|想要|要|可以|喜欢|爱|可以|应该)听?的?(什么|哪些|哪种|哪类|啥|啥子)?(歌|儿歌|音乐|儿童歌曲|幼儿歌曲|曲子) => request(适用人群="$3",操作="$1") <0.3>;
export 适用人群6=(适合)?(${适用人群1})(能|能够|想|想要|要|可以|喜欢|爱|可以|应该)听?的?(什么|哪些|哪种|哪类|啥|啥子)?(歌|儿歌|音乐|儿童歌曲|幼儿歌曲|曲子)(${播放}|${播放2}|${music_查找})? => request(适用人群="$2",操作="$6") <0.3>;
###add for tx2.0 by jk
export 适用人群7=(${music_查找}|${播放}|${播放2})(适合)?(${适用人群1})听?的?(${风格})?(什么|哪些|哪种|哪类|啥|啥子)?的?(歌|儿歌|音乐|儿童歌曲|幼儿歌曲|曲子)(怎么样|好吗|如何|可以吗|行吗)?$ => request(适用人群="$3",操作="$1",歌曲名="@") <0.3>;
export 适用人群8=(哄|让)(${适用人群1})(${场景})的?(歌|儿歌|音乐|儿童歌曲|幼儿歌曲|曲子) => request(适用人群="$2") <0.3>;
export 适用人群9=(${适用人群1})(${music_查找}|${播放}|${播放2})(一个|一点|一些|一下|个|首|一首)?(${场景})(听|会听|适合听|能听|可以听)的(儿童歌曲|儿歌|幼儿歌曲|音乐) => request(适用人群="$1",操作="$2",歌曲名="@") <0.3>;
#export 适用人群10=(给)(${适用人群1})听?的?(什么|哪些|哪种|哪类|啥|啥子)?(歌|儿歌|音乐|儿童歌曲|幼儿歌曲|曲子) => request(适用人群="$2",操作="$1",歌曲名="@") <0.3>;
#fix bug
export 适用人群10=(给)(${适用人群1})听?的?(什么|哪些|哪种|哪类|啥|啥子)?(歌|儿歌|音乐|儿童歌曲|幼儿歌曲|曲子) => request(适用人群="$2",歌曲名="@") <0.3>;
####xn
export 适用人群10=(给)(${适用人群1})(${播放}|${播放2}|${music_查找})(关于)?(${主题})的(${音乐类型}) => request(适用人群="$2",主题="$4",歌曲名="@") <0.3>;
export 适用人群10=(${播放}|${播放2}|${music_查找}|我想听|我要听|给我播)(关于)?(${主题})的(${音乐类型}) => request(主题="$3",歌曲名="@") <0.3>;
export 适用人群10=(${对象})(${播放}|${播放2}|${music_查找}) => request(操作="$2") <0.3>;



