适用人名=[^我|俺|们|咱|他|她|它|个|点|吗].{1,10};



export 适用人名3=(给|为)(${适用人名})(${播放}|${播放2}|${music_查找1})(段|一段)?(适合)?(${适用年龄})(的|听的|时的|时听的)?(${语种})?的?(${音乐}) => request(适用人名="$2",操作="$3",对象="$9",适用年龄="$6") <0.42>;
export 适用人名1=(给|为)(${适用人名})(${播放}|${播放2}|${music_查找1})(段|一段)?(适合)?(${场景})?(的|听的|时的|时听的)?(${音乐}) => request(适用人名="$2",操作="$3",对象="$8",音乐场景="$6") <0.41>;
export 适用人名2=(给|为)(${适用人名})(${播放}|${播放2}|${music_查找1})(段|一段)?(${语种})的?(${音乐}) => request(适用人名="$2",操作="$3",对象="$6",语种="$5") <0.41>;

export 适用人名2=(${对象})(${播放}|${播放2}|${music_查找1})(段|一段)?(${适用人名})(要听|想听|想要听) => request(适用人名="$4") <0.41>;

##### add by caixiang for tx2.1
#export name_tx21_00=^(你)?(能|可以|能够)?(请)?(给|为)(${适用人名})(${播放}|${播放2}|${music_查找1}) => request(适用人名="$5",操作="$3") <0.03>;
export name_tx21_01=^(能|可以|能够)?(请)?(给|为)(${适用人名})?(${播放}|${播放2}|${music_查找1})(${风格})(的)?(${音乐类型})(${语气词})?$ => request(操作="$5",歌曲名="@",风格="$6",歌手名="@",音乐类型="$8",适用人名="$4")<0.7>;
export name_tx21_02=^(能|可以|能够)?(请)?(给|为)(${适用人名})?(${播放}|${播放2}|${music_查找1})(${风格})(的)?(${对象})(${语气词})?$ => request(操作="$5",歌曲名="@",风格="$6",歌手名="@",对象="$8",音乐类型="@",适用人名="$4")<0.7>;
export name_tx21_03=^(${风格})(的)?(${音乐类型})(${播放}|${播放2}|${music_查找1})(${适用人名})(要听|想听)$ => request(操作="$4",歌曲名="@",风格="$1",音乐类型="$3",歌手名="@",适用人名="$5")<0.5>;
export name_tx21_04=^(${风格})(的)?(${对象})(${播放}|${播放2}|${music_查找1})(${适用人名})(要听|想听)$ => request(操作="$4",歌曲名="@",风格="$1",对象="$3",音乐类型="@",歌手名="@",适用人名="$5")<0.5>;

export name_tx21_01=^(能|可以|能够)?(请)?(给|为)(我|我们|大家)(${播放}|${播放2}|${music_查找1})(${风格})(的)?(${音乐类型})(${语气词})?$ => request(操作="$5",歌曲名="@",风格="$6",歌手名="@",音乐类型="$8",适用人名="")<0.71>;
export name_tx21_02=^(能|可以|能够)?(请)?(给|为)(我|我们|大家)(${播放}|${播放2}|${music_查找1})(${风格})(的)?(${对象})(${语气词})?$ => request(操作="$5",歌曲名="@",风格="$6",歌手名="@",对象="$8",音乐类型="@",适用人名="")<0.71>;
export name_tx21_03=^(${风格})(的)?(${音乐类型})(${播放}|${播放2}|${music_查找1})(我|我们|大家)(要听|想听)$ => request(操作="$4",歌曲名="@",风格="$1",音乐类型="$3",歌手名="@",适用人名="")<0.51>;
export name_tx21_04=^(${风格})(的)?(${对象})(${播放}|${播放2}|${music_查找1})(我|我们|大家)(要听|想听)$ => request(操作="$4",歌曲名="@",风格="$1",对象="$3",音乐类型="@",歌手名="@",适用人名="")<0.51>;

export name_tx21_05=^(能|可以|能够)?(请)?(给|为)(${适用人名})?(${播放}|${播放2}|${music_查找1})(${音乐类型})(${mu_版})?(的)?(${歌曲名})?(${语气词})?$ => request(操作="$5",歌曲名="$9",歌手名="@",音乐类型="$6",适用人名="$4",对象="$7")<0.5>;
export name_tx21_06=^(${音乐类型})(${mu_版})?(的)?(${歌曲名})?(${播放}|${播放2}|${music_查找1})(${适用人名})(要听|想听)$ => request(操作="$5",适用人名="$6",歌曲名="$4",音乐类型="$1",歌手名="@",对象="$2")<0.5>;

export name_tx21_07=^(你)?(能|可以|能够)?(请)?(给|为)(${适用人名})(${播放}|${播放2}|${music_查找1})(${mu音乐类型and})(${mu_版})?(的)?(${歌曲名})?(${语气词})?$ => request(适用人名="$5",操作="$6",歌曲名="$10",歌手名="@",音乐类型="$7",对象="$8")<0.5>;

export name_tx21_05=^(能|可以|能够)?(请)?(给|为)(我|我们|大家)(${播放}|${播放2}|${music_查找1})(${音乐类型})(${mu_版})?(的)?(${歌曲名})?(${语气词})?$ => request(适用人名="",操作="$5",歌曲名="$9",歌手名="@",音乐类型="$6",对象="$7")<0.51>;
export name_tx21_06=^(${音乐类型})(${mu_版})?(的)?(${歌曲名})?(${播放}|${播放2}|${music_查找1})(我|我们|大家)(要听|想听)$ => request(适用人名="",操作="$5",歌曲名="$4",音乐类型="$1",歌手名="@",对象="$2")<0.51>;

export name_tx21_07=^(你)?(能|可以|能够)?(请)?(给|为)(我|我们|大家)(${播放}|${播放2}|${music_查找1})(${mu音乐类型and})(${mu_版})?(的)?(${歌曲名})?(${语气词})?$ => request(适用人名="",操作="$6",歌曲名="$10",歌手名="@",音乐类型="$7",对象="$8")<0.51>;

export name_tx21_08=^(${mu音乐类型and})(${播放}|${播放2}|${music_查找1})(${适用人名})(要听|想听)$ => request(音乐类型="$1",操作="$2",适用人名="$3")<0.5>;
export name_tx21_09=(${语种})(的)?(${音乐类型})(${播放}|${播放2}|${music_查找1})(${适用人名})(要听|想听)$ => request(语种="$1",音乐类型="$3",操作="$4",适用人名="$5")<0.3>;
export name_tx21_08=^(${mu音乐类型and})(${播放}|${播放2}|${music_查找1})(我|我们|大家)(要听|想听)$ => request(适用人名="",音乐类型="$1",操作="$2")<0.51>;
export name_tx21_09=(${语种})(的)?(${音乐类型})(${播放}|${播放2}|${music_查找1})(${适用人名})(我|我们|大家)$ => request(适用人名="",语种="$1",音乐类型="$3",操作="$4")<0.31>;
#####
