##### by zhangyu & peilu.w #####
##### 古诗领域支持诗句搜索 #####

#include "{pwd}/../../misc/num.lex"

##### 变量定义 #####
rule 古诗名={.古诗}|{.poetry_标题}
单字古诗名={.poetry_单字标题}
古诗_作者={.poetry_作者}

plus _合成诗句={.poetry_诗句}
#_合成诗句1={.poetry_诗句}{_合成诗句}+
_合成国学句子={.poetry_国学句子}
_合成国学句子1={.poetry_国学句子}{_合成国学句子}+ => _logical,item1="1",item2="2"
古诗_诗句={.poetry_诗句}|{.poetry_国学句子}|{_合成诗句1}|{_合成国学句子1}



poe古诗_类别={.poetry_对象}
atom poe说=说|讲|读|朗读|朗诵|念|来 
atom poe背诵=背|背诵
atom poe播放=播|播放|放 
atom poe收听=我|我们?想|想要|要?听
atom poe观看=想看|要看
poe操作={poe说}|{poe背诵}|{poe播放}|{poe收听}|{poe观看}

atom 上一句=上一句|前一句|上句|前句
atom 下一句=下一句|后一句|下句|后句
rule 操作_上下句={上一句}|{下一句}

atom 第一句=第一句|首句
atom 第二句=第二句|次句 
atom 尾句=尾句|末句|倒数第一句|最后一句
atom 次尾句=次尾句|次末句|倒数第二句
## by zhangyu, 2019-04-17, 添加句子位置的新说法支持
atom gs句子_最前=最先|前|前面|前边|靠前|靠前边|靠前面|上面|上端的?那|那一|一|这|这一|第一句 
atom gs句子_最后=最后|后面|后边|靠后|靠后边|靠后面|下面|下端的?那|那一|一|这|这一|倒数第一句 
atom 句子次序={第一句}|{第二句}|{尾句}|{次尾句}|{gs句子_最前}|{gs句子_最后}

atom 语气词=吧|呗|哇|呀|呢|嘛|哦|啦|哈|呐|吖|咯
atom 句首修饰词=我想|我要|我想要|我需要|我希望|帮忙|帮我|替我|给我|为我|请|请给我|请帮我|请为我|请替我|麻烦|麻烦给我|麻烦帮我|麻烦为我|麻烦替我|请你|你帮我|你替我|你给我|你为我|麻烦你|我们想|我们要|我们想要|我们需要|我们希望|帮我们|替我们|给我们|为我们|请给我们|请帮我们|请为我们|请替我们|麻烦给我们|麻烦帮我们|麻烦为我们|麻烦替我们|你帮我们|你替我们|你给我们|你为我们|帮忙|请帮忙|麻烦请 


##### 包含文件 #####
#include "{pwd}/varlex/对象.lex"
#include "{pwd}/varlex/古诗.lex"
#include "{pwd}/varlex/古诗配对.lex"
#include "{pwd}/varlex/查询对象.lex"
#include "{pwd}/varlex/释义.lex"

##### update by zhangyu #####
##### 给古诗领域添加slot操作="背诵"|"说"|"收听" #####


atom 停用词 = 的


atom 量词 = 一?个|一?段|一?首|一?下|点|两首|两个|几首|些|几个|会

export poetry4={poe古诗_类别}({古诗名}) 
#export poetry4=({古诗名})<2,-1> => request(古诗名="1") <0.2>;
export poetry4_2={古诗名}

## 操作 & 古诗名 ##
export poetry4_1 = {poe操作}{量词}?{poe古诗_类别}?{古诗名}

##### update by zhangyu & peilu.wang #####
##### 支持新说法 & 新的搜索条件 #####
## 作者名 ##
export poetry6_5=({古诗_作者}) {停用词} ({poe古诗_类别}) 
export poetry6_6=({古诗_作者}){停用词}?(作品|大作|诗歌) 
## 作者名&古诗名 ##
export poetry7_5=({古诗_作者}){停用词}?({poe古诗_类别}|作品|大作|诗歌)({古诗名}) 
export poetry7_7=({古诗_作者}) {停用词}?({古诗名}) 
## 单句诗句 ##
export poetry8={古诗_诗句}
##
export poetry_and1=({_合成诗句1}) => request(诗句="1") <0.2>;
export poetry_and2=({_合成国学句子1}) => request(诗句="1") <0.2>;
##
##### by zhangyu #####
## 单字古诗名 ##
export poetry_sp1 = (想|要|想要)(看|听){量词}?({古诗_作者})?(的)?(唐诗|古诗)({单字古诗名}) 
export poetry_sp2 = ^(给我|为我)?(来|说|讲|背|背诵|读|朗读|念)(一)?(个|段|首|下)?({古诗_作者})?(的)?(唐诗|古诗)({单字古诗名}) 

##add by jiangkun
export poetry1_1=({poe操作}){量词} ({古诗_作者})?(的|写的)?({poe古诗_类别})?({古诗名}) 
export poetry7_4=({poe操作}) {量词}?({古诗_作者})?(的)?({poe古诗_类别}) 

#add by jy 20170919
export poetry9_1=({古诗名})({古诗_作者}) 

#古诗名和诗句重复的bug
export poetry1_2=({poe操作}) {量词}?({古诗_作者})?(的|写的)?({poe古诗_类别})?({古诗名})({语气词})? 

# for 酷旗_线上分析 20180102 JY
export poetry01021=({poe操作}) {量词}? ({古诗_诗句}) 

# kuqi 线上数据 lyf
export poetry0115 = ({古诗名})怎么({poe背诵}|{poe说})({语气词})? 

##### by zhangyu & peilu.w #####
##### 古诗句子定位搜索 #####
#句子定位
#上下句   
export gushi3=({古诗_诗句}){停用词}?,({操作_上下句}) 
#句子次序
export gushi3=({古诗名}){停用词}?,({句子次序}) 
#第N句
第N句=第({整数})句 => ("1");
export gushi3=({古诗名}){停用词}?,({第N句}) 
#倒数第N句
倒数第N句=倒数第({整数})句 => (_join, prefix="#", mid="1");
export gushi3=({古诗名}){停用词}?,({倒数第N句}) 

##### update by zhangyu #####
##### 给故事领域添加slot操作="收听"|"说"|"背诵" #####

export poetry1=({poe观看}|{poe收听}){量词}?({poe古诗_类别}) 

export poetry2_1=({poe说}|{poe背诵}){量词}?({poe古诗_类别}) 

export poetry6=({poe古诗_类别}) 

##### update by zhangyu & peilu.wang #####
##### 支持新说法 #####
## 朗读(操作归一到"说") ##
export poetry7_1=[{poe说}| {poe播放}, {量词}?, ({poe古诗_类别} ]
##### by zhangyu & peilu.wang #####
##### 给定搜索条件, 搜索特定的内容 #####

atom 出自 = 是|来自|出自
atom 哪首 = 哪首|那首|哪个|哪|哪一个
atom 其中 = 里|里面|中|中间|其中|里的|里面的
atom 含有 = 有|含|含有|包含

atom 作者 = 诗人|作者

atom 唐诗 = 唐诗|古诗|诗|诗句|名句|词
atom 创作 = 大作|写的|作品|所作|所写|所创作|创作|提出|发表|写出
atom 释义 = 翻译|解释|释义|意思|含义|译文

#查询对象
#给古诗名问作者
export gushi4=({古诗名}){停用词}?,(作者) 
export gushi4=({古诗名})(是?)(谁){停用词}?,(大作|写的|作品|所作|所写|所创作|创作|提出|发表|写出|诗|词|古诗) 
#给句子问作者
export gushi4=({古诗_诗句}){停用词}?,(作者)
export gushi4=({古诗_诗句}){出自}?(谁){停用词}?,(大作|写的|作品|所作|所写|所创作|创作|提出|发表|写出|诗|词|古诗) 

#给句子问古诗名
export gushi4=({古诗_诗句})(出自)?{哪首} (诗|词|古诗|唐诗)(里的|里面的|的)?(句子)? 
export gushi5 = (哪|什么){量词}?(诗|古诗|唐诗)(里|里面|中|中间|其中)(有|含|含有|包含)(那个|那句|那一句)?({古诗_诗句}) 

## by zhangyu ##
## 添加查询句式 ##
export gushi5 = (哪一?个)(诗人|作者)(写|作|提)(的|了)?(唐诗|古诗|诗)?({古诗名}) 
export gushi6 = (哪一?个)(诗人|作者)(写|作|提)(的|了)?(诗句|名句)?({古诗_诗句}) 

##kuqi 线上资源 lyf
export gushi7=({古诗名})(那首诗|这首诗)(是?)(谁){停用词}?,(大作|写的|作品|所作|所写|所创作|创作|提出|发表|写出|诗|词|古诗) 

export poetry100=({古诗_作者})?(的|写的|创作的)?({古诗_诗句})应?该?是?(怎么|咋|如何|的)(翻译|解释|释义|意思|含义|译文) 
export poetry101=({古诗_作者})?(的|写的|创作的)?({古诗_诗句})的?({poe古诗_类别})的?(翻译|解释|释义|意思|含义|译文) 
export poetry102=({古诗_作者})?(的|写的|创作的)?({古诗_诗句})的?(古诗|诗词|现代文|普通话|白话|白话文)的?(翻译|解释|释义|意思|含义|译文) 
export poetry103=({古诗_作者})?(的|写的|创作的)?({古诗_诗句}){句首修饰词}?(翻译|解释|释义|意思|含义|译文) 

export poetry104=({古诗_作者})?(的|写的|创作的)?({古诗_诗句})你?(会|能|可以|会不会|能不能|可不可以|可以不可以)(翻译|解释|释义) 
export poetry105=({古诗_作者})?(的|写的|创作的)?({古诗_诗句})你?(知道|晓得)应?该?是?(怎么|咋|如何)(翻译|解释|释义) 
export poetry106=({古诗_作者})?(的|写的|创作的)?({古诗_诗句})你?{句首修饰词}?(查|找|搜|查询|查找|解释|看)(一?下)?应?该?(怎么|咋|如何|的)(翻译|解释|释义) 

export poetry107=({古诗_作者})?(的|写的|创作的)?({古诗_诗句})应?该?是?(什么|啥|怎么|咋)(翻译|解释|释义|意思|含义|译文) 

export poetry108=(怎么|咋)(翻译|解释|释义)({古诗_作者})?(的|写的|创作的)?({古诗_诗句}) 
export poetry109=(翻译|解释|释义)(一?下)?({古诗_作者})?(的|写的|创作的)?({古诗_诗句}) 
export poetry110=(把|将)({古诗_作者})?(的|写的|创作的)?({古诗_诗句})给?(翻译|解释|释义) 

export poetry111=(把|将)({古诗_作者})?(的|写的|创作的)?({古诗_诗句})给?(翻译|解释|释义|译)(成|为) 
