##### by zhangyu & peilu.w #####
##### 古诗领域支持诗句搜索 #####

#include "${pwd}/../../misc/num.lex"

##### 变量定义 #####
古诗名=${.古诗}|${.poetry_标题};
单字古诗名=${.poetry_单字标题};
古诗_作者=${.poetry_作者};

_合成诗句=(${.poetry_诗句}) => (_douhao,item="$1");
_合成诗句1=(${.poetry_诗句})(${_合成诗句}+) => (_logical,item1="$1",item2="$2");
_合成国学句子=(${.poetry_国学句子}) => (_douhao,item="$1");
_合成国学句子1=(${.poetry_国学句子})(${_合成国学句子}+) => (_logical,item1="$1",item2="$2");
古诗_诗句=${.poetry_诗句}|${.poetry_国学句子}|${_合成诗句1}|${_合成国学句子1};



##poe古诗=(诗|古诗) => ("古诗");
##poe唐诗=(唐诗) => ("唐诗");
##poe诗=(${poe古诗}|${poe唐诗});
##poe宋词=(宋词) => ("宋词");
##poe词=(词|${poe宋词});
poe古诗_类别=(${.poetry_对象});
poe说=(说|讲|读|朗读|朗诵|念|来) => ("说");
poe背诵=(背|背诵) => ("背诵");
poe播放=(播|播放|放) => ("播放");
poe收听=(我|我们)?(想|想要|要)?听 => ("收听");
poe观看=想看|要看=> ("观看");
poe操作=(${poe说}|${poe背诵}|${poe播放}|${poe收听}|${poe观看});

上一句=(上一句|前一句|上句|前句)=> ("上一句");
下一句=(下一句|后一句|下句|后句)=> ("下一句");
操作_上下句=(${上一句}|${下一句});

第一句=(第一句|首句) => ("1") ;
第二句=(第二句|次句) => ("2") ;
尾句=(尾句|末句|倒数第一句|最后一句) => ("#1");
次尾句=(次尾句|次末句|倒数第二句) => ("#2");
## by zhangyu, 2019-04-17, 添加句子位置的新说法支持
gs句子_最前=最(先|前|前面|前边|靠前|靠前边|靠前面|上面|上端)的?(那|那一|一|这|这一|第一)(句) => ("1");
gs句子_最后=最(后|后面|后边|靠后|靠后边|靠后面|下面|下端)的?(那|那一|一|这|这一|倒数第一)(句) => ("#1");
句子次序=(${第一句}|${第二句}|${尾句}|${次尾句}|${gs句子_最前}|${gs句子_最后});

语气词=(吧|呗|哇|呀|呢|嘛|哦|啦|哈|呐|吖|咯);
句首修饰词=我想|我要|我想要|我需要|我希望|帮忙|帮我|替我|给我|为我|请|请给我|请帮我|请为我|请替我|麻烦|麻烦给我|麻烦帮我|麻烦为我|麻烦替我|请你|你帮我|你替我|你给我|你为我|麻烦你|我们想|我们要|我们想要|我们需要|我们希望|帮我们|替我们|给我们|为我们|请给我们|请帮我们|请为我们|请替我们|麻烦给我们|麻烦帮我们|麻烦为我们|麻烦替我们|你帮我们|你替我们|你给我们|你为我们|帮忙|请帮忙|麻烦请 ;


##### 包含文件 #####
#include "${pwd}/varlex/对象.lex"
#include "${pwd}/varlex/古诗.lex"
#include "${pwd}/varlex/古诗配对.lex"
#include "${pwd}/varlex/查询对象.lex"
#include "${pwd}/varlex/释义.lex"
##### update by zhangyu #####
##### 给古诗领域添加slot操作="背诵"|"说"|"收听" #####

export poetry4=(poe古诗_类别)(${古诗名}) => request(古诗名="$2") <0.9>;
export poetry4=(${古诗名})<2,-1> => request(古诗名="$1") <0.2>;

@$
五言绝句静夜思
静夜思
我想听一首五言绝句静夜思

## 操作 & 古诗名 ##
export poetry4_1 = (${poe操作})(一)?(个|段|首|下)?(poe古诗_类别)?(${古诗名}) => request(古诗名="$5", 操作="$1") <0.3>;

@$
背诵一首五言绝句静夜思
背诵一首静夜思
背诵五言绝句静夜思
背诵静夜思

##### update by zhangyu & peilu.wang #####
##### 支持新说法 & 新的搜索条件 #####
## 作者名 ##
export poetry6_5=(${古诗_作者})(的)?(${poe古诗_类别}) => request(对象="$3", 作者="$1") <0.2>;
export poetry6_6=(${古诗_作者})(的)?(作品|大作|诗歌) => request(作者="$1") <0.1>;
## 作者名&古诗名 ##
export poetry7_5=(${古诗_作者})(的)?(${poe古诗_类别}|作品|大作|诗歌)(${古诗名}) => request(作者="$1", 古诗名="$4") <0.3>;
export poetry7_7=(${古诗_作者})(的)?(${古诗名}) => request(作者="$1", 古诗名="$3") <0.1>;

@$
李白的七言律诗
李白的诗
李白的作品
李白的五言绝句静夜思
李白的静夜思


## 单句诗句 ##
export poetry8=(${古诗_诗句}) => request(诗句="$1") <0.1>;
##
export poetry_and1=(${_合成诗句1}) => request(诗句="$1") <0.2>;
export poetry_and2=(${_合成国学句子1}) => request(诗句="$1") <0.2>;

@$
窗前明月光
窗前明月光疑是地上霜

##
##### by zhangyu #####
## 单字古诗名 ##
export poetry_sp1 = (想|要|想要)(看|听)(一)?(个|段|首|下)?(${古诗_作者})?(的)?(唐诗|古诗)(${单字古诗名}) => request(作者="$6", 古诗名="$8") <0.3>;
export poetry_sp2 = ^(给我|为我)?(来|说|讲|背|背诵|读|朗读|念)(一)?(个|段|首|下)?(${古诗_作者})?(的)?(唐诗|古诗)(${单字古诗名}) => request(作者="$5", 古诗名="$8") <0.3>;

@$
给我背诵一首李白的夜  单子古诗名
背诵一首夜  单子古诗名
背诵李白夜  单子古诗名
背诵李白的?夜  单字古诗名    一个好处是用非状态机的技术处理歧义


##add by jiangkun
export poetry1_1=(${poe操作})(个|一个|一段|段|首|一首|一些|一?下)?(${古诗_作者})?(的|写的)?(${poe古诗_类别})?(${古诗名}) => request(古诗名="$6", 操作="$1", 对象="$5", 作者="$3") <0.6>;
export poetry7_4=(${poe操作})(一)?(个|段|首|下|点|两首|两个|几首|些|几个|会)?(${古诗_作者})?(的)?(${poe古诗_类别}) => request(作者="$4", 对象="$6", 操作="$1") <0.6>;

@$
给我背诵一首李白写的静夜思


#add by jy 20170919
export poetry9_1=(${古诗名})(${古诗_作者}) => request(作者="$2", 古诗名="$1") <0.2>;

@$
静夜思李白

#古诗名和诗句重复的bug
export poetry1_2=(${poe操作})(个|一个|一段|段|首|一首|一些|一?下)?(${古诗_作者})?(的|写的)?(${poe古诗_类别})?(${古诗名})(${语气词})?$ => request(古诗名="$6",诗句="",操作="$1", 对象="$5", 作者="$3") <0.61>;

@$
给我背诵一首李白写的五言律诗静夜思

# for 酷旗_线上分析 20180102 JY
export poetry01021=(${poe操作})(一)?(个|段|首|下)?(${古诗_诗句}) => request(操作="$1") <0.2>;

@$
背诵一段床前明月光

# kuqi 线上数据 lyf
export poetry0115 = (${古诗名})怎么(${poe背诵}|${poe说})(${语气词})?$ => request(古诗名="$1",操作="$2") <0.3>;

@$
静夜思怎么背诵啊

##### by zhangyu & peilu.w #####
##### 古诗句子定位搜索 #####
#句子定位
#上下句   
export gushi3=(${古诗_诗句})(的?)(${操作_上下句}) => request(操作="$3", 诗句="$1" ) <0.5>;
#句子次序
export gushi3=(${古诗名})(的?)(${句子次序}) => request(古诗名="$1",位置="$3") <0.5>;
#第N句
第N句=第(${整数})句 => ("$1");
export gushi3=(${古诗名})(的?)(${第N句}) => request(古诗名="$1",位置="$3") <0.4>;
#倒数第N句
倒数第N句=倒数第(${整数})句 => (_join, prefix="#", mid="$1");
export gushi3=(${古诗名})(的?)(${倒数第N句}) => request(古诗名="$1",位置="$3") <0.4>;

@$
静夜诗的第二句
静夜诗的最后一句
静夜诗的倒数第二句
床前明月光的下一句

##### update by zhangyu #####
##### 给故事领域添加slot操作="收听"|"说"|"背诵" #####

export poetry1=(我想听|我要听)(个|一个|首|一首)?(${poe古诗_类别}) => request(对象="$3", 操作="收听") <0.2>;
export poetry1=(我想看|我要看)(个|一个|首|一首)?(${poe古诗_类别}) => request(对象="$3", 操作="观看") <0.2>;

export poetry2_1=(${poe说}|${poe背诵})(一)?(个|段|首|下)?(${poe古诗_类别}) => request(对象="$4", 操作="$1") <0.2>;

export poetry6=(${poe古诗_类别}) => request(对象="$1") <0.1>;

@$
我要听一首七言绝句
七言绝句

##### update by zhangyu & peilu.wang #####
##### 支持新说法 #####
## 朗读(操作归一到"说") ##
export poetry7_1=(${poe说})(一)?(个|首|下|段|点|两首|两个|几首|一些|几个)?(${poe古诗_类别}) => request(对象="$4", 操作="说") <0.2>;
export poetry8_1 = (播|放|播放)(一)?(个|首|下|段|点|两首|两个|几首|一些|几个)?(${poe古诗_类别}) => request(对象="$4", 操作="播放") <0.2>;

@$
播放一首七言绝句

##### by zhangyu & peilu.wang #####
##### 给定搜索条件, 搜索特定的内容 #####
#查询对象
#给古诗名问作者
export gushi4=(${古诗名})(的?)(作者) => request(查询对象="作者",古诗名="$1") <0.5>;
export gushi4=(${古诗名})(是?)(谁)(的?)(大作|写的|作品|所作|所写|所创作|创作|提出|发表|写出|诗|词|古诗) => request(查询对象="作者",古诗名="$1") <0.5>;
#给句子问作者
export gushi4=(${古诗_诗句})(的?)(作者)=> request(查询对象="作者",诗句="$1") <0.5>;
export gushi4=(${古诗_诗句})(是|来自|出自)?(谁)(的?)(大作|写的|作品|所作|所写|所创作|创作|提出|发表|写出|诗|词|古诗) => request(查询对象="作者",诗句="$1") <0.5>;

@$
静夜思的作者
静夜思是谁写的/创作的
静夜思是谁的作品
床前明月光的作者
床前明月光出自谁的作品


#给句子问古诗名
export gushi4=(${古诗_诗句})(是|来自|出自)?(哪|那)(首|个)(诗|词|古诗|唐诗)(里的|里面的|的)?(句子)? => request(查询对象="古诗名",诗句="$1") <0.5>;
export gushi5 = (哪|什么)(一)?(首|段|个)?(诗|古诗|唐诗)(里|里面|中|中间|其中)(有|含|含有|包含)(那个|那句|那一句)?(${古诗_诗句}) => request(查询对象="古诗名", 诗句="$8") <0.5>;

@$
床前明月光出自哪首唐诗
床前明月光出自哪首唐诗里的句子
床前明月光出自哪首唐诗
哪一首唐诗里面含有床前明月光


## by zhangyu ##
## 添加查询句式 ##
export gushi5 = (哪一?个)(诗人|作者)(写|作|提)(的|了)?(唐诗|古诗|诗)?(${古诗名}) => request(查询对象="作者", 古诗名="$6") <0.2>;
export gushi6 = (哪一?个)(诗人|作者)(写|作|提)(的|了)?(诗句|名句)?(${古诗_诗句}) => request(查询对象="作者", 诗句="$6") <0.2>;

@$
哪一个诗人写了唐诗静夜思
哪一个诗人写了静夜思
哪一个诗人写了名句床前明月光
哪一个诗人写了床前明月光

##kuqi 线上资源 lyf
export gushi7=(${古诗名})(那首诗|这首诗)(是?)(谁)(的?)(大作|写的|作品|所作|所写|所创作|创作|提出|发表|写出|诗|词|古诗) => request(查询对象="作者",古诗名="$1",对象="") <0.5>;# wjz 20190702

@$
静夜思那首诗是谁的作品


export poetry100=(${古诗_作者})?(的|写的|创作的)?(${古诗_诗句})应?该?是?(怎么|咋|如何|的)(翻译|解释|释义|意思|含义|译文) => request(intent="查询诗词释义", 作者="$1", 诗句="$3") <0.6>;
export poetry101=(${古诗_作者})?(的|写的|创作的)?(${古诗_诗句})的?(${poe古诗_类别})的?(翻译|解释|释义|意思|含义|译文) => request(intent="查询诗词释义", 作者="$1", 诗句="$3", 对象="$4", 古诗名="") <0.6>;
export poetry102=(${古诗_作者})?(的|写的|创作的)?(${古诗_诗句})的?(古诗|诗词|现代文|普通话|白话|白话文)的?(翻译|解释|释义|意思|含义|译文) => request(intent="查询诗词释义", 作者="$1", 诗句="$3") <0.6>;
export poetry103=(${古诗_作者})?(的|写的|创作的)?(${古诗_诗句})${句首修饰词}?(翻译|解释|释义|意思|含义|译文) => request(intent="查询诗词释义", 作者="$1", 诗句="$3") <0.6>;


export poetry104=(${古诗_作者})?(的|写的|创作的)?(${古诗_诗句})你?(会|能|可以|会不会|能不能|可不可以|可以不可以)(翻译|解释|释义) => request(intent="查询诗词释义", 作者="$1", 诗句="$3") <0.6>;
export poetry105=(${古诗_作者})?(的|写的|创作的)?(${古诗_诗句})你?(知道|晓得)应?该?是?(怎么|咋|如何)(翻译|解释|释义) => request(intent="查询诗词释义", 作者="$1", 诗句="$3") <0.6>;
export poetry106=(${古诗_作者})?(的|写的|创作的)?(${古诗_诗句})你?${句首修饰词}?(查|找|搜|查询|查找|解释|看)(一?下)?应?该?(怎么|咋|如何|的)(翻译|解释|释义) => request(intent="查询诗词释义", 作者="$1", 诗句="$3") <0.6>;

@$
李白的床前明月光如何翻译/释义
李白的床前明月光的白话文释义
李白写的床前明月光我想看/会不会/可以 翻译/释义
李白写的诗句床前明月光搜索一下应该怎么翻译/释义
李白写的诗句床前明月光应该怎么翻译/释义
应该怎么翻译/释义李白写的诗句床前明月光
翻译/释义一下李白写的诗句床前明月光
把李白写的诗句床前明月光翻译/释义下

export poetry107=(${古诗_作者})?(的|写的|创作的)?(${古诗_诗句})应?该?是?(什么|啥|怎么|咋)(翻译|解释|释义|意思|含义|译文) => request(intent="查询诗词释义", 作者="$1", 诗句="$3") <0.6>;

export poetry108=(怎么|咋)(翻译|解释|释义)(${古诗_作者})?(的|写的|创作的)?(${古诗_诗句}) => request(intent="查询诗词释义", 作者="$3", 诗句="$5") <0.6>;
export poetry109=(翻译|解释|释义)(一?下)?(${古诗_作者})?(的|写的|创作的)?(${古诗_诗句}) => request(intent="查询诗词释义", 作者="$3", 诗句="$5") <0.6>;
export poetry110=(把|将)(${古诗_作者})?(的|写的|创作的)?(${古诗_诗句})给?(翻译|解释|释义) => request(intent="查询诗词释义", 作者="$2", 诗句="$4") <0.6>;

export poetry111=(把|将)(${古诗_作者})?(的|写的|创作的)?(${古诗_诗句})给?(翻译|解释|释义|译)(成|为) => request(intent="查询诗词释义", 作者="$2", 诗句="$4") <0.6>;
