# wjz 20190702

export poetry100=(${古诗_作者})?(的|写的|创作的)?(${古诗_诗句})应?该?是?(怎么|咋|如何|的)(翻译|解释|释义|意思|含义|译文) => request(intent="查询诗词释义", 作者="$1", 诗句="$3") <0.6>;
export poetry101=(${古诗_作者})?(的|写的|创作的)?(${古诗_诗句})的?(${poe古诗_类别})的?(翻译|解释|释义|意思|含义|译文) => request(intent="查询诗词释义", 作者="$1", 诗句="$3", 对象="$4", 古诗名="") <0.6>;
export poetry102=(${古诗_作者})?(的|写的|创作的)?(${古诗_诗句})的?(古诗|诗词|现代文|普通话|白话|白话文)的?(翻译|解释|释义|意思|含义|译文) => request(intent="查询诗词释义", 作者="$1", 诗句="$3") <0.6>;
export poetry103=(${古诗_作者})?(的|写的|创作的)?(${古诗_诗句})${句首修饰词}?(翻译|解释|释义|意思|含义|译文) => request(intent="查询诗词释义", 作者="$1", 诗句="$3") <0.6>;

export poetry104=(${古诗_作者})?(的|写的|创作的)?(${古诗_诗句})你?(会|能|可以|会不会|能不能|可不可以|可以不可以)(翻译|解释|释义) => request(intent="查询诗词释义", 作者="$1", 诗句="$3") <0.6>;
export poetry105=(${古诗_作者})?(的|写的|创作的)?(${古诗_诗句})你?(知道|晓得)应?该?是?(怎么|咋|如何)(翻译|解释|释义) => request(intent="查询诗词释义", 作者="$1", 诗句="$3") <0.6>;
export poetry106=(${古诗_作者})?(的|写的|创作的)?(${古诗_诗句})你?${句首修饰词}?(查|找|搜|查询|查找|解释|看)(一?下)?应?该?(怎么|咋|如何|的)(翻译|解释|释义) => request(intent="查询诗词释义", 作者="$1", 诗句="$3") <0.6>;

export poetry107=(${古诗_作者})?(的|写的|创作的)?(${古诗_诗句})应?该?是?(什么|啥|怎么|咋)(翻译|解释|释义|意思|含义|译文) => request(intent="查询诗词释义", 作者="$1", 诗句="$3") <0.6>;

export poetry108=(怎么|咋)(翻译|解释|释义)(${古诗_作者})?(的|写的|创作的)?(${古诗_诗句}) => request(intent="查询诗词释义", 作者="$3", 诗句="$5") <0.6>;
export poetry109=(翻译|解释|释义)(一?下)?(${古诗_作者})?(的|写的|创作的)?(${古诗_诗句}) => request(intent="查询诗词释义", 作者="$3", 诗句="$5") <0.6>;
export poetry110=(把|将)(${古诗_作者})?(的|写的|创作的)?(${古诗_诗句})给?(翻译|解释|释义) => request(intent="查询诗词释义", 作者="$2", 诗句="$4") <0.6>;

export poetry111=(把|将)(${古诗_作者})?(的|写的|创作的)?(${古诗_诗句})给?(翻译|解释|释义|译)(成|为) => request(intent="查询诗词释义", 作者="$2", 诗句="$4") <0.6>;

