##### update by zhangyu #####
##### 给故事领域添加slot操作="收听"|"说"|"背诵" #####

export poetry1=(我想听|我要听)(个|一个|首|一首)?(${poe古诗_类别}) => request(对象="$3", 操作="收听") <0.2>;
export poetry1=(我想看|我要看)(个|一个|首|一首)?(${poe古诗_类别}) => request(对象="$3", 操作="观看") <0.2>;

export poetry2_1=(${poe说}|${poe背诵})(一)?(个|段|首|下)?(${poe古诗_类别}) => request(对象="$4", 操作="$1") <0.2>;

export poetry6=(${poe古诗_类别}) => request(对象="$1") <0.1>;

##### update by zhangyu & peilu.wang #####
##### 支持新说法 #####
## 朗读(操作归一到"说") ##
export poetry7_1=(${poe说})(一)?(个|首|下|段|点|两首|两个|几首|一些|几个)?(${poe古诗_类别}) => request(对象="$4", 操作="说") <0.2>;
export poetry8_1 = (播|放|播放)(一)?(个|首|下|段|点|两首|两个|几首|一些|几个)?(${poe古诗_类别}) => request(对象="$4", 操作="播放") <0.2>;
