export songname1=(${操作})(歌曲|一首|音乐)?(${歌手名})的(${歌曲名})(给我|来听听|听一下|来听一下|来听下) => request(歌曲名="$4") <0.4>;
export songname31=(${操作})(歌曲|一首|音乐)(${音乐类型})?(${歌曲名})(${语气词})?$ => request(歌曲名="$4",__act__="inform",__tgt__="") <0.35>;
export songname311=^(${句首修饰词})?(${操作})(歌曲|曲子|音乐|歌)?(${歌曲名})(来听听|听一下|来听一下|来听下|听听|${语气词})?$ => request(操作="$2",歌曲名="$4",__act__="inform",__tgt__="",歌手名="@",页码="@") <0.636>;
export songname8=(${歌手名})(唱的|的)(${歌曲名})$ => request(歌手名="$1",歌曲名="$3") <0.3>;
export songname10=(歌曲|一首|首歌|来首|唱首|想听|要听|放首|打开|那首|一听|有没有|听听|听个|一下|歌叫|的歌|放个|唱的)(${歌曲名}) => request(歌曲名="$2") <0.2>;
export songname110=^(帮我|给我|为我)?(唱一首|来首|唱首|我?想听|我?要听|放首|听听|听个|放个)(${单字歌名})(${语气词})?$ => request(歌曲名="$3") <0.18>;
export songname4=(来|唱)一?(首)歌?(${歌曲名})(给我) => request(歌曲名="$3") <0.2>;
export songname22=^(${歌曲名})$ => request(歌曲名="$1") <0.35>;
export songname2=^(${歌曲名})(${语气词})?$ => request(歌曲名="$1") <0.3>;
export songname7=(${操作})(歌曲|一首|音乐)?(${歌曲名})(${语气词})?$ => request(歌曲名="$3") <0.2>;
export songname9=[^切换到|切换成|切换为|切换至](${歌曲名})(歌曲)?(${操作})(${语气词})?$ => request(歌曲名="$1") <0.1>;
export songname9=(${歌曲名})的?(歌曲|歌)(${操作})?$ => request(歌曲名="$1") <0.1>;
export songname111=(${歌曲名})<3,-1>$  => request(歌曲名="$1") <0.1>;
export songname1111=(${歌曲名})(${当前歌曲})<3,-1>$  => request(歌曲名="$1") <0.2>;
export songname112=(查|查找|找)(一下|下)?(${歌曲名})(${语气词})$  => request(歌曲名="$3") <0.1>;
export songname113=(唱|播|放)(一下)?(${歌曲名})(给我听)(${语气词})?$  => request(歌曲名="$3") <0.4>;


#export songname15=(${歌曲名})要(${歌手名}) => request(歌曲名="$1") <0.1>;
#export songname11=(${音乐类型})的?(${歌曲名}) => request(歌曲名="$2") <0.1>;
#export songname12=(${歌曲名})(${歌手名})的 => request(歌曲名="$1") <0.1>;
#export songname7=(歌曲|一首|首歌|来首|唱首|想听|要听|放首|打开|那首|一听|有没有|听听|听个|一下|歌叫|的歌|放个|唱的|听)(${歌曲名}) => request(歌曲名="$2") <0.1>;
#export songname13=(${主题})(的|里的)(${歌曲名}) => request(歌曲名="$3") <0.1>;
#export songname14=(${歌曲名})(来听|听听|原唱) => request(歌曲名="$1") <0.1>;
#export songname7=(${操作})(歌曲|一首)(${歌曲名}) => request(歌曲名="$3") <0.2>;


songlabel_or1=(或|或者)(这首|那首)?(${歌曲名}) => (_or,item="$3");
songlabel_or2=(${歌曲名})(这首|这首歌)?(${songlabel_or1}+) => (_logical,item1="$1",item2="$3");
export 歌曲名10=(${songlabel_or2}) => request(歌曲名="$1")<0.7>;

songlabel_not1=(不是|不要|不是要|不想要|别听|不听|不想听)听?(${歌曲名})(这首歌)? => (_not,item="$2");
songlabel_not2=我?是?(是|要|听|想听|有没有)听?(${歌曲名}).*(${songlabel_not1}) => (_logical,item1="$2",item2="$3");
songlabel_not3=我?(${songlabel_not1}).*(是|要|听|想听|有没有)听?(${歌曲名}) => (_logical,item1="$3",item2="$1");
export 歌曲名12=(${songlabel_not2}) => request(歌曲名="$1",__act__="inform",__tgt__="") <0.6>;
export 歌曲名13=(${songlabel_not3}) => request(歌曲名="$1",__act__="inform",__tgt__="") <0.6> ;

#songlabel_not4=(有没有)(不是)(${歌曲名}) => (_not,item="$3");
#songlabel_not5=(有)(不是)(${歌曲名})的吗 => (_not,item="$3");
#export 歌曲名14=(${songlabel_not4}|${songlabel_not5}) => request(歌曲名="$1",__act__="inform",__tgt__="") ;


export songname1=(${操作}|我想听|我要听)(${音源})(上|上面)的?(${歌手名})的(${歌曲名})(${语气词})?$ => request(歌曲名="$5",歌手名="$4",音源="$2",crfflag="0") <0.8>;

export songname31=(我想听|我要听|${来首}|${播放}|听)(一下|下)?(${歌手名})(版|版本|唱)?的(${单字歌名})$ => request(歌曲名="$5") <0.8>;
export songname32=^(${歌手名})的(${单字歌名})(播放)?$ => request(歌曲名="$2") <0.4>;
export songname33=(我想听|我要听|${来首}|播放)(一下|下)?(${单字歌名})$ => request(歌曲名="$3") <0.8>;
export songname34=^(${单字歌名})$ => request(歌曲名="$1") <0.2>;
export songname35=(我想听|我要听|${来首}|播放|有没有)(一下|下)?(${歌手名})?的?(歌曲|歌)(${单字歌名})$ => request(歌曲名="$5") <0.8>;
export songname36=^(给我)?(我想听|我要听|播放)(一下|下)?(歌曲|音乐)?(${单字歌名})$ => request(歌曲名="$5") <0.8>;
export songname37=^(给我)?(听)(一下|下)?(歌曲|音乐|歌)?(${单字歌名})$ => request(歌曲名="$5") <0.2>;

##### by zhangyu #####
##### 添加 "你会唱XXX" 的说法 #####
export songname4=(你)?(会唱|能唱)(${歌曲名})(${语气词})?$ => request(歌曲名="$3") <0.2>;

###tengxun
export songname38=(我想听|我要听|${来首}|播放)(一下|下)?(${年代})的?(歌|歌曲|音乐)(${语气词})?$ => request(年代="$3",歌曲名="") <0.8>;
export songname39=(我想听|我要听|${来首}|播放)(一下|下)?(${歌手名})的(那个|那个那个)?(${歌曲名})(${语气词})?$ => request(主题="",歌曲名="$5") <0.801>;
export songname4=^(你好小乐)?(播放)(${歌曲名}) => request(歌曲名="$3") <0.02>;

### 联想需求 by zhangyu ###
export songname5 = (${乐器}|${语种})(版|版本|类|类型)?(的)?(${歌曲名}) => request(歌曲名="$4") <0.2>;
export songname5 = (${歌曲名})(用|使用|是用|就是用)(${乐器}|${语种})(弹|唱|演唱|歌唱|弹奏|演奏) => request(歌曲名="$1") <0.2>;

export opt_find=(找|查找|查|搜|问)(下|一下)?(${歌曲名}) => request(歌曲名="$3") <0.10>;
export songname2=^(${歌曲名})(给我|帮我|我要)?(${操作}|我想听一下|我想听一听)$ => request(歌曲名="$1") <0.3>;

###xn 情歌 歌曲 与 类型冲突 添加特例

export songname2=梁静茹的?情歌 => request(歌曲名="情歌") <0.15>;

####
######播放安静的歌 与 歌名 安静 冲突
####播放风格 与 歌名可能冲突
#export song_bug=播放安静的歌 =>request(歌曲名="@")<0.8>; 
export song_bug2=播放(${风格})的(歌|音乐) =>request(歌曲名="@")<0.8>; 
####add by xuyang 继续限制关于安静和风格的冲突
####处理单独说 播放歌曲名的时候 会出风格的问题
export song_bug3=^(${句首修饰词}?)(${播放})安静的(歌|音乐|曲子|歌曲|歌谣|曲儿|${对象})?(${语气词})?$ =>request(歌曲名="@")<0.8>; 
export song_bug4=^(${句首修饰词}?)(${播放})(${歌曲名})(${语气词})?$ =>request(风格="@")<0.8>; 

#by jy
export song0920=^(${句首修饰词}?)(${播放}|听一?听?|${m来些2})(${儿童歌曲})(${单字歌名}|${歌曲名})(${语气词})?$=> request(歌曲名="$4",歌手名="@") <0.4>;
export song_bug0102=^(亲爱的)(能不能|可不可以|可以)?(帮我|给我|为我|替我)(${播放}|寻找)(一?首|一?个|一?些)(歌|音乐|曲子|歌曲|歌谣|曲儿|${对象})(${语气词})?$ =>request(歌曲名="@")<0.8>; 

###bug 音乐再见产生操作退出 lyf
export song_bug1110 = ^(${句首修饰词})?听(一首|一曲|下|一下)?(${音乐})?(${歌曲名})(${语气词})?$ => request(操作="收听",歌手名="",歌曲名="$4") <0.802>;

#酷奇热歌 lyf
export hot_song1=^(${句首修饰词})?(放|来|播|播放)(一?个|一?首|一?曲|一?下)?(${hot歌曲名})(${语气词})?$ => request(__act__="inform",操作="播放",歌曲名="$4",歌手名="",对象="",风格="") <0.81>;
export hot_song1=^(${句首修饰词})?听(一?个|一?首|一?曲|一?下)?(${hot歌曲名})(${语气词})?$ => request(__act__="inform",操作="收听",歌曲名="$3",歌手名="@",对象="",风格="") <0.81>;

export hot_song2=^(${句首修饰词})?(唱)(一?个|一?首|一?曲|一?下)?(${hot歌曲名})(${语气词})?$ => request(__act__="inform",操作="演唱",歌曲名="$4",歌手名="",对象="",风格="") <0.81>;


# xxx来首音乐
export bug11=(.{2,10})(${播放1}|寻找首|搜一?首)音乐(${语气词})?$ => request(歌曲名="@") <0.1>;
# xxx来首音乐 lyf
export bug11=(.{2,10})(${播放1}|寻找首|搜一?首)音乐(${语气词})?$ => request(歌曲名="@") <0.1>;

##kuqi线上资源 lyf
export song15=^(${句首修饰词})?(${播放})(一?个|一?首|一?曲|一?下)?(${歌曲名})的?(${音乐类型})(${语气词})?$ => request(操作="$2",歌曲名="$4",音乐类型="$5") <0.511>;
export song15_1=^(${句首修饰词})?(${播放})(一?个|一?首|一?曲|一?下)?(${歌曲名})的?(${主题类型})(${语气词})?$ => request(操作="$2",歌曲名="$4") <0.5>;
export song15_2=^(${句首修饰词})?(${播放})(一?个|一?首|一?曲|一?下)?(${歌曲名})的(歌|歌曲|音乐)(${语气词})?$ => request(操作="$2",歌曲名="$4") <0.71>;

export song15_3=^(${句首修饰词})?(${播放})(一?个|一?首|一?曲|一?下)?(${场景})的(歌|歌曲|音乐)(${语气词})?$ => request(操作="$2",音乐场景="$4") <0.75>;
##kuqi 兼容 lyf
export song15_2=(${歌手名})(表演|演绎|演唱)的(${音乐类型})(${歌曲名})(${语气词})?$ => request(歌手名="$1",音乐类型="$3",歌曲名="$4") <0.391>;
export song15_3=(${歌手名})(表演|演绎|演唱)的(${歌曲名})的?(${音乐类型})(${语气词})?$ => request(歌手名="$1",音乐类型="$4",歌曲名="$3") <0.391>;
export song15_4=(${音乐类型})(${歌手名})(表演|演绎|演唱)的(${歌曲名})(${语气词})?$ => request(歌手名="$2",音乐类型="$1",歌曲名="$4") <0.391>;

## by zhangyu, 2019-08-13
export song_bug_zy1 = ^(我想要|我想|我要|想?要)(那一?个)?(${歌手名})(唱的|的)(歌|歌曲|音乐|曲|曲子)(${语气词})?$ => request(歌曲名="@", 歌手名="$3") <0.31>;


