歌词=.{3,20};
export lyric01=${music_查找}(这歌|这首歌|这个歌|这歌的|这首歌的|这个歌的)?(歌词)=> request(__act__="request",__tgt__="$2") <0.43>;
export lyric02=(${music_发送}|推送)(这歌的|这首歌的|这个歌的|这歌|这首歌|这个歌)?(歌词)(到|给)(我|我的)?(手机)=> request(操作="$1",对象="$3") <0.42>;
export lyric03=(把|将)(这歌的|这首歌的|这个歌的|这歌|这首歌|这个歌)?(歌词)(发送|推送)(到|给|至)(我|我的)?(手机)=> request(操作="$4",对象="$3") <0.44>;
export lyric05=(这歌的|这首歌的|这个歌的|这歌|这首歌|这个歌)?(歌词)是(啥|什么)?=> request(__act__="request",__tgt__="$2") <0.22>;
export lyric06=${music_查找}(${歌手名})(的|唱的|演唱的)?(${歌曲名})(的)?(歌词)=> request(__act__="request",__tgt__="$5",歌手名="$1",歌曲名="$3") <0.70>;
export lyric07=${music_查找}(${歌曲名})(的)?(歌词) => request(__act__="request",__tgt__="$3",歌曲名="$1") <0.70>;
export lyric08=${music_查找}(${歌曲名})(的)?(歌词)(${歌手名})(的|唱的|演唱的)? => request(__act__="request",__tgt__="$3",歌手名="$4",歌曲名="$1") <0.71>;
export lyric09=(${歌手名})(的|唱的|演唱的)?(${歌曲名})(的)?(歌词) => request(__act__="request",__tgt__="$5",歌手名="$1",歌曲名="$3") <0.75>;
export lyric10=(${歌曲名})(的|这歌|这首歌|这个歌|这歌的|这首歌的|这个歌的)?(歌词) => request(__act__="request",__tgt__="$3",歌曲名="$1") <0.35>;
export lyric10_1=(${music_发送}|推送)(${歌曲名})(的|这歌|这首歌|这个歌|这歌的|这首歌的|这个歌的)?(歌词) => request(__act__="inform",歌曲名="$2",__tgt__="") <0.36>;
export lyric11=(${歌曲名})(的|这歌|这首歌|这个歌|这歌的|这首歌的|这个歌的)?(歌词)(${歌手名})(的|唱的|演唱的)?=> request(__act__="request",__tgt__="$3",歌曲名="$1",歌手名="$4") <0.76>;

export lyric12=^(有首歌|有首歌的|有一首歌|有一首歌的)?(歌词|歌词是|歌词是这样唱的|歌词是这么唱的)(${歌词})(这首歌|这|这歌)(是什么|叫什么)(歌|歌曲)?$=> request(__act__="request",__tgt__="歌曲名",歌词="$3",歌曲名="@") <0.6>;
export lyric13=^(有首歌|有首歌的|有一首歌|有一首歌的)?(歌词|歌词是|歌词是这样唱的|歌词是这么唱的)(${歌词})这是(什么|啥|哪个)歌(呢|啊|呀)?$=> request(__act__="request",__tgt__="歌曲名",歌词="$3",歌曲名="@") <0.6>;
