##### by zhangyu & peilu.w #####
##### 古诗领域支持诗句搜索 #####

#include "${pwd}/../../misc/num.lex"

##### 变量定义 #####
古诗名=${.古诗}|${.poetry_标题};
单字古诗名=${.poetry_单字标题};
古诗_作者=${.poetry_作者};

_合成诗句=(${.poetry_诗句}) => (_douhao,item="$1");
_合成诗句1=(${.poetry_诗句})(${_合成诗句}+) => (_logical,item1="$1",item2="$2");
_合成国学句子=(${.poetry_国学句子}) => (_douhao,item="$1");
_合成国学句子1=(${.poetry_国学句子})(${_合成国学句子}+) => (_logical,item1="$1",item2="$2");
古诗_诗句=${.poetry_诗句}|${.poetry_国学句子}|${_合成诗句1}|${_合成国学句子1};



##poe古诗=(诗|古诗) => ("古诗");
##poe唐诗=(唐诗) => ("唐诗");
##poe诗=(${poe古诗}|${poe唐诗});
##poe宋词=(宋词) => ("宋词");
##poe词=(词|${poe宋词});
poe古诗_类别=(${.poetry_对象});
poe说=(说|讲|读|朗读|朗诵|念|来) => ("说");
poe背诵=(背|背诵) => ("背诵");
poe播放=(播|播放|放) => ("播放");
poe收听=(我|我们)?(想|想要|要)?听 => ("收听");
poe观看=想看|要看=> ("观看");
poe操作=(${poe说}|${poe背诵}|${poe播放}|${poe收听}|${poe观看});

上一句=(上一句|前一句|上句|前句)=> ("上一句");
下一句=(下一句|后一句|下句|后句)=> ("下一句");
操作_上下句=(${上一句}|${下一句});

第一句=(第一句|首句) => ("1") ;
第二句=(第二句|次句) => ("2") ;
尾句=(尾句|末句|倒数第一句|最后一句) => ("#1");
次尾句=(次尾句|次末句|倒数第二句) => ("#2");
## by zhangyu, 2019-04-17, 添加句子位置的新说法支持
gs句子_最前=最(先|前|前面|前边|靠前|靠前边|靠前面|上面|上端)的?(那|那一|一|这|这一|第一)(句) => ("1");
gs句子_最后=最(后|后面|后边|靠后|靠后边|靠后面|下面|下端)的?(那|那一|一|这|这一|倒数第一)(句) => ("#1");
句子次序=(${第一句}|${第二句}|${尾句}|${次尾句}|${gs句子_最前}|${gs句子_最后});

语气词=(吧|呗|哇|呀|呢|嘛|哦|啦|哈|呐|吖|咯);
句首修饰词=我想|我要|我想要|我需要|我希望|帮忙|帮我|替我|给我|为我|请|请给我|请帮我|请为我|请替我|麻烦|麻烦给我|麻烦帮我|麻烦为我|麻烦替我|请你|你帮我|你替我|你给我|你为我|麻烦你|我们想|我们要|我们想要|我们需要|我们希望|帮我们|替我们|给我们|为我们|请给我们|请帮我们|请为我们|请替我们|麻烦给我们|麻烦帮我们|麻烦为我们|麻烦替我们|你帮我们|你替我们|你给我们|你为我们|帮忙|请帮忙|麻烦请 ;


##### 包含文件 #####
#include "${pwd}/varlex/对象.lex"
#include "${pwd}/varlex/古诗.lex"
#include "${pwd}/varlex/古诗配对.lex"
#include "${pwd}/varlex/查询对象.lex"
#include "${pwd}/varlex/释义.lex"
