## by zhangyu 2016-06-06 ##
## 故事领域新领域分类 ##



#export story1_1 = ^(${st给我}|${st我想听你})?(${st讲}|${st播})(${st量词})?(${st故事类型})的?故事$ => request(storyflag1="故事", domain="故事", test="$1") <0.9>;
#export 成语名 = (${.story_常用成语})(是)(一?个成语) => request(成语="$1", domain="成语");
#export st经典 = (经典的?故事|经典类型?的?故事)(我想听)了 => request(tp1="$1", domain="故事") <0.9>;
#export 经典 = (经典的?故事|经典类型?|的?故事)(我|想听)了 => request(tp1="$1", domain="故事") <0.9>;

歌曲名 = 忘情水|清华次|hi_hude
语气词 = 啊|呢
感叹词 = 啊|呢
export s1 = 不是.*(${歌曲名})?[的的爱]  => request(__act__="deny", __tgt__="歌曲名",  歌曲名="$1")
#不是[deny:忘情水:歌曲名]
export s2 = 查找.{3,5}(${歌曲名})?的歌词 => request(__act__="request", __tgt__="歌词", 歌曲名="$1" )

#export intro1 = (何|何种|什么|什么样|啥|啥子|啥样|哪些|哪几个)的?(信用卡|卡) => request(intent="介绍信用卡") <0.3>;
#export 金额解释12 = (不能办理的是那一部分|可分期金额怎么少了一部分|差的部分为什么不能分期|能办理的太少了|能办理的金额太少了|怎么会少点)(${语气词})?$ => request(intent="金额解释") <0.5>;
确认状态 = 是的|可以
#export 确认6 = (${感叹词})?(${确认状态}){2,4}(${感叹词})? => request(intent="肯定") <0.23>;
st_童话寓言=(童话寓言故事|童话寓言) => ("童话寓言");
#export story3_3 = ^(${st给我}|${st我想})?(${st看}|${st播}|${st听}|来)(${st量词})?(${st叫作})?(${故事名}|${story_专辑名})的(${st故事类型}|${st故事类型_宽泛})(${语气词}|行吗|行不|怎么样)?$ => request(storyflag1="故事", domain="故事") <0.8>;
